Repository: GNOME/NetworkManager-openconnect
Catalog: po/*.po
Languages: ru

source: Failed to open certificate file %s: %s
ru: Не удалось открыть файл сертификата %s: %s

source: Failed to open secondary certificate file %s: %s
ru: Не удалось открыть файл вторичного сертификата %s: %s

source: Loading certificate failed
ru: Не удалось загрузить сертификат

source: Failed to process all supporting certs. Trying anyway...
ru: Сбой обработки всех поддерживаемых сертификатов. Всё равно продолжаем попытки…

source: Failed to process secondary supporting certs. Trying anyway...
ru: Сбой обработки вторичных поддерживаемых сертификатов. Всё равно продолжаем попытки…

source: PEM file
ru: Файл PEM

source: Failed to create BIO for keystore item '%s'
ru: Не удалось создать BIO для элемента хранилища ключей '%s'

source: Loading private key failed (wrong passphrase?)
ru: Не удалось загрузить закрытый ключ (неверная парольная фраза?)

source: Loading secondary private key failed (wrong passphrase?)
ru: Не удалось загрузить вторичный закрытый ключ (неверная парольная фраза?)

source: Loading private key failed (see above errors)
ru: Не удалось загрузить закрытый ключ (см. ошибки выше)

source: Loading secondary private key failed (see above errors)
ru: Не удалось загрузить вторичный закрытый ключ (см. ошибки выше)

source: Failed to load X509 certificate from keystore
ru: Не удалось загрузить сертификат X509 из хранилища ключей

source: Failed to open private key file %s: %s
ru: Не удалось открыть файл закрытого ключа %s: %s

source: Loading secondary private key failed
ru: Не удалось загрузить вторичный закрытый ключ

source: Failed to decrypt secondary PKCS#8 certificate file
ru: Не удалось расшифровать файл вторичного сертификата PKCS#8

source: Enter PKCS#8 secondary pass phrase:
ru: Введите вторичную парольную фразу PKCS#8:

source: Failed to convert PKCS#8 to OpenSSL EVP_PKEY
ru: Не удалось преобразовать PKCS#8 в OpenSSL EVP_PKEY

source: Failed to convert secondary PKCS#8 to OpenSSL EVP_PKEY
ru: Не удалось преобразовать вторичный PKCS#8 в OpenSSL EVP_PKEY

source: Failed to identify private key type in '%s'
ru: Не удалось идентифицировать тип закрытого ключа в '%s'

source: Matched DNS altname '%s'
ru: Соответствует альтернативному имени DNS '%s'

source: No match for altname '%s'
ru: Нет соответствия альтернативному имени '%s'

source: Certificate has GEN_IPADD altname with bogus length %d
ru: У сертификата имеется альтернативное имя GEN_IPADD с фиктивной длиной %d

source: Matched %s address '%s'
ru: Совпадает с %s адресом '%s'

source: No match for %s address '%s'
ru: Не найдено соответствий для адреса %s '%s'

source: URI '%s' has non-empty path; ignoring
ru: Не пустой путь URI '%s'; игнорируется

source: Matched URI '%s'
ru: Соответствующий URI '%s'

source: No match for URI '%s'
ru: Нет соответствий для URI '%s'

source: No altname in peer cert matched '%s'
ru: Нет альтернативных имён в сертификате пира, совпадающих с '%s'

source: No subject name in peer cert!
ru: В сертификате пира отсутствует имя субъекта

source: Failed to parse subject name in peer cert
ru: Не удалось проанализировать имя субъекта в сертификате пира

source: Peer cert subject mismatch ('%s' != '%s')
ru: Несоответствие субъекта в сертификате пира ('%s' != '%s')

source: Matched peer certificate subject name '%s'
ru: Имя субъекта в сертификате пира соответствует '%s'

source: Extra cert from cafile: '%s'
ru: Дополнительный сертификат из cafile: '%s'

source: Error in client cert notAfter field
ru: Ошибка в поле notAfter сертификата клиента

source: Error in secondary client cert notAfter field
ru: Ошибка в поле notAfter вторичного сертификата клиента

source: SSL certificate and key do not match
ru: Сертификат SSL и ключ не соответствуют

source: Failed to read certs from CA file '%s'
ru: Не удалось прочитать сертификаты из файла ЦС «%s»

source: Failed to open CA file '%s'
ru: Не удалось открыть файл ЦС '%s'

source: Create TLSv1 CTX failed
ru: Сбой создания TLSv1 CTX

source: Failed to construct OpenSSL cipher list
ru: Не удалось создать список шифров OpenSSL

source: Failed to set OpenSSL cipher list ("%s")
ru: Не удалось настроить список шифров OpenSSL ("%s")

source: SSL connection failure
ru: Сбой подключения SSL

source: Failed to calculate OATH HMAC
ru: Не удалось рассчитать OATH HMAC

source: EAP-TTLS negotiation with %s
ru: Согласование EAP-TTLS с %s

source: EAP-TTLS connection failure %d
ru: Сбой подключения EAP-TTLS %d

source: Failed to generate STRAP key
ru: Не удалось создать ключ STRAP

source: Failed to generate STRAP DH key
ru: Не удалось создать ключ STRAP DH

source: Failed to decode STRAP key
ru: Не удалось расшифровать ключ STRAP

source: Failed to decode server DH key
ru: Не удалось расшифровать ключ DH сервера

source: Failed to compute DH secret
ru: Не удалось вычислить секрет DH

source: HKDF key derivation failed
ru: Не удалось выполнить вычисление ключа HKDF

source: SSO token decryption failed
ru: Не удалось расшифровать токен единого входа

source: SSL Finished message too large (%zu bytes)
ru: Слишком длинное сообщение SSL Finished (%zu байт)

source: Failed to generate channel bindings for STRAP key
ru: Не удалось создать привязки каналов для ключа STRAP key

source: STRAP signature failed
ru: Сбой подписи STRAP

source: Failed to regenerate STRAP key
ru: Не удалось повторно создать ключ STRAP

source: Failed to create PKCS#7 structure
ru: Не удалось создать структуру PKCS#7

source: Failed to output PKCS#7 structure
ru: Сбой вывода структуры PKCS#7

source: Failed to generate signature for multiple certificate authentication
ru: Не удалось создать подпись для аутентификации по нескольким сертификатам

source: HDLC initial flag sequence (0x7e) is missing
ru: Отсутствует начальная последовательность флага HDLC (0x7e)

source: HDLC buffer ended without FCS and flag sequence (0x7e)
ru: Буфер HDLC завершился без последовательности FCS и последовательности флага (0x7e)

source: HDLC frame too short (%d bytes)
ru: Слишком короткий кадр HDLC (%d байт)

source: Bad HDLC packet FCS %04x
ru: Неверная последовательность FCS %04x пакета HDLC

source: Un-HDLC'ed packet (%ld bytes -> %ld), FCS=0x%04x
ru: Пакет вне протокола HDLC (%ld байт -> %ld), FCS=0x%04x

source: Current PPP state: %s (encap %s):
ru: Текущее состояние PPP: %s (инкапсуляция %s):

source: in: asyncmap=0x%08x, lcp_opts=%d, lcp_magic=0x%08x, ipv4=%s, ipv6=%s
ru: входящ.: asyncmap=0x%08x, lcp_opts=%d, lcp_magic=0x%08x, ipv4=%s, ipv6=%s

source: out: asyncmap=0x%08x, lcp_opts=%d, lcp_magic=0x%08x, ipv4=%s, ipv6=%s, solicit_peerns=%d, got_peerns=%d
ru: исходящ.: asyncmap=0x%08x, lcp_opts=%d, lcp_magic=0x%08x, ipv4=%s, ipv6=%s, solicit_peerns=%d, got_peerns=%d

source: Received MRU %d from server. Nak-offering larger MRU of %d (our MTU)
ru: От сервера получен MRU %d. Посылаем NAK с предложением MRU размером %d (наш MTU)

source: Received MRU %d from server. Setting our MTU to match.
ru: От сервера получен MRU %d. Настраиваем наш MTU соответственно.

source: Received asyncmap of 0x%08x from server
ru: От сервера получен asyncmap со значением 0x%08x

source: Received magic number of 0x%08x from server
ru: От сервера получено магическое число со значением 0x%08x

source: Received protocol field compression from server
ru: Получено сжатие поля протокола от сервера

source: Received address and control field compression from server
ru: От сервера получено сжатие полей адреса и управления

source: Received deprecated IP-Addresses from server, ignoring
ru: От сервера получены адреса IP в старом формате, игнорируем

source: Received Van Jacobson TCP/IP compression from server
ru: От сервера получено сжатие TCP/IP Ван Якобсона

source: Received peer IPv4 address %s from server
ru: От сервера получен адрес IPv4 %s пира

source: Received peer IPv6 link-local address %s from server
ru: От сервера получен адрес IPv6 link-local %s

source: Received unknown %s TLV (tag %d, len %d+2) from server:
ru: От севера получен неизвестный TLV %s (метка %d, длина %d+2):

source: Received %ld extra bytes at end of Config-Request:
ru: В конце Config-Request получено %ld дополнительных байтов:

source: Reject %s/id %d config from server
ru: Сервер не принял конфигурацию %s/id %d

source: Nak %s/id %d config from server
ru: Неподтверждение приёма конфигурации %s/id %d от сервера

source: Ack %s/id %d config from server
ru: Конфигурация ack %s/id %d от сервера

source: Requesting calculated MTU of %d
ru: Запрашиваем рассчитанное значение MTU: %d

source: Sending our %s/id %d config request to server
ru: Отправляем серверу наш запрос %s/id %d на конфигурацию

source: Server rejected/nak'ed LCP MRU option
ru: Сервер отклонил/не подтвердил приём параметра LCP MRU

source: Server rejected/nak'ed LCP asyncmap option
ru: Сервер отклонил/не подтвердил приём параметра LCP asyncmap

source: Server rejected LCP magic option
ru: Сервер отклонил «магический параметр» LCP

source: Server rejected/nak'ed LCP PFCOMP option
ru: Сервер отклонил/не подтвердил приём параметра LCP PFCOMP

source: Server rejected/nak'ed LCP ACCOMP option
ru: Сервер отклонил/не подтвердил приём параметра LCP ACCOMP

source: Server nak-offered IPv4 address: %s
ru: Сервер отклонил/не подтвердил адрес IPv4: %s

source: Server rejected Legacy IP address %s
ru: Сервер отклонил адрес IP старого формата %s

source: Server rejected/nak'ed our IPv4 address or request: %s
ru: Сервер отклонил/не подтвердил приём нашего адреса IPv4 или запроса: %s

source: Server nak-offered IPCP request for %s[%d] server: %s
ru: Сервер не подтвердил приём запроса IPCP для сервера %s[%d]: %s

source: Server rejected/nak'ed IPCP request for %s[%d] server
ru: Сервер отклонил/не подтвердил приём запроса IPCP для сервера %s[%d]

source: Server nak-offered IPv6 link-local address %s
ru: Сервер не подтвердил приём адреса IPv6 link-local %s

source: Server rejected/nak'ed our IPv6 interface identifier
ru: Сервер отклонил/не подтвердил приём идентификатора нашего интерфейса IPv6

source: Server rejected/nak'ed %s TLV (tag %d, len %d+2)
ru: Сервер отклонил/не подтвердил приём %s TLV (тег %d, длина %d+2)

source: Received %ld extra bytes at end of Config-Reject:
ru: Получено %ld дополнительных байтов в конце Config-Reject:

source: Received %s/id %d %s from server
ru: Получено %s/id %d %s от сервера

source: Server terminates with reason: %s
ru: Сервер отключается с причиной: %s

source: Server rejected our request to configure IPv%d
ru: Сервер отклонил наш запрос на создание конфигурации IPv%d

source: PPP state transition from %s to %s on %s channel
ru: Переход состояния PPP из %s в %s на канале %s

source: PPP payload exceeds receive buffer
ru: Полезные данные PPP превышают размер принимающего буфера

source: Short packet received (%d bytes). Waiting for more.
ru: Получен короткий пакет (%d байт). Ожидаем ещё данных.

source: Unexpected pre-PPP packet header for encap %d.
ru: Непредвиденный заголовок пакета перед PPP для инкапсуляции %d.

source: PPP payload len %d exceeds receive buffer %d
ru: Длина полезных данных PPP %d превышает размер принимающего буфера %d

source: PPP packet is incomplete. Received %d bytes on wire (includes %d encap) but header payload_len is %d. Waiting for more.
ru: Неполный пакет PPP. Получено подряд %d байтов (включая %d инкапсуляции), но размер payload_len заголовка равен %d. Ожидаем ещё данных.

source: Invalid PPP encapsulation
ru: Недействительная инкапсуляция PPP

source: Packet contains %d bytes after payload. Assuming concatenated packet.
ru: После полезных данных пакет содержит %d байт. Предполагаем, что пакет урезан.

source: Unexpected IPv%d packet in PPP state %s.
ru: Непредвиденный пакет IPv%d в состоянии PPP %s.

source: Received IPv%d data packet of %d bytes over %s
ru: Получен пакет данных IPv%d размером %d байт с использованием %s

source: Expected %d PPP header bytes but got %ld, shifting payload.
ru: Ожидался заголовок PPP размером %d байт, но получено %ld, сдвинуты полезные данные.

source: Sending Protocol-Reject for %s. Payload:
ru: Отправляем Protocol-Reject для %s. Полезные данные:

source: Detected dead peer!
ru: Обнаружен нерабочий пир

source: Failed to establish PPP
ru: Не удалось создать PPP

source: Send PPP discard request as keepalive
ru: Послан запрос на отброс PPP как запрос активности подключения

source: Send PPP echo request as DPD
ru: Послан PPP эхо-запрос в качестве DPD

source: Sending PPP %s %s packet over %s (id %d, %d bytes total)
ru: Отправляем пакет PPP %s %s поверх %s (id %d, всего байт: %d)

source: Sending PPP %s packet over %s (%d bytes total)
ru: Отправляем пакет PPP %s поверх %s (всего байт: %d)

source: PPP connect called with invalid DTLS state %d
ru: PPP connect был вызван с недействительным состоянием DTLS %d

source: DTLS tunnel connected; exiting HTTPS mainloop.
ru: Тоннель DTLS подключён; выполняется выход из основного цикла HTTPS.

source: Failed to connect DTLS tunnel; using HTTPS instead (state %d).
ru: Не удалось подключить тоннель DTLS; используем HTTPS (состояние %d).

source: Establishing PPP tunnel over TLS failed
ru: Сбой создания тоннеля PPP поверх TLS failed

source: Invalid DTLS state %d
ru: Недействительное состояние DTLS %d

source: Reset PPP failed
ru: Не удалось вернуть начальное состояние PPP

source: Failed to authenticate DTLS session
ru: Сбой аутентификации сеанса DTLS

source: Received internal Legacy IP address %s
ru: Получен внутренний адрес IP в старом формате %s

source: Failed to handle IPv6 address
ru: Не удалось обработать адрес IPv6

source: Received internal IPv6 address %s
ru: Получен внутренний адрес IPv6 %s

source: Received IPv6 split include %s
ru: Получен включаемый IPv6 %s для раздельного туннелирования

source: Received IPv6 split exclude %s
ru: Получен исключаемый IPv6 %s для раздельного туннелирования

source: Unexpected length %d for attr 0x%x
ru: Непредвиденная длина %d атрибута 0x%x

source: ESP encryption: 0x%04x (%s)
ru: Шифрование ESP: 0x%04x (%s)

source: ESP only: %d
ru: Только ESP: %d

source: Received internal gateway IPv6 address %s
ru: Получен внутренний адрес IPv6 шлюза %s

source: Received proxy auto-config (PAC) payload of size %d
ru: Получены полезные данные для proxy auto-config (PAC) размером %d

source: Received proxy auto-config (PAC) URL: %.*s
ru: Получен адрес URL для proxy auto-config (PAC): %.*s

source: Pulse ESP tunnel allowed to carry 6in4 or 4in6 traffic: %d
ru: Тоннель Pulse ESP с возможностью передачи трафика 6in4 или 4in6: %d

source: Unknown attr 0x%04x len %d:%s
ru: Неизвестный атрибут 0x%04x длиной %d:%s

source: Read %d bytes of IF-T/TLS record
ru: Чтение %d байт записи IF-T/TLS

source: Short write to IF-T/TLS
ru: Недостаточно данных для записи в IF-T/TLS

source: Error creating IF-T packet
ru: Ошибка создания пакета IF-T

source: Error creating EAP packet
ru: Ошибка создания пакета EAP

source: Unexpected IF-T/TLS authentication challenge:
ru: Непредвиденный вызов (challenge) аутентификации IF-T/TLS:

source: Unexpected EAP-TTLS payload:
ru: Непредвиденные полезные данные EAP-TTLS:

source: Enter Pulse user realm:
ru: Введите область пользователя Pulse:

source: Realm:
ru: Область:

source: Choose Pulse user realm:
ru: Выберите область пользователя Pulse:

source: Choose Pulse region:
ru: Выберите регион Pulse:

source: Region:
ru: Регион:

source: Failed to parse AVP
ru: Не удалось проанализировать AVP

source: Session limit reached. Choose session to kill:
ru: Достигнуто предельное число сеансов. Выберите сеанс для завершения (kill):

source: Session:
ru: Сеанс:

source: Failed to parse session list
ru: Не удалось проанализировать список сеансов

source: Enter secondary credentials:
ru: Введите вторичные учётные данные:

source: Enter user credentials:
ru: Введите учётные данные пользователя:

source: Secondary username:
ru: Вторичное имя пользователя:

source: Username:
ru: Имя пользователя:

source: Password:
ru: Пароль:

source: Secondary password:
ru: Вторичный пароль:

source: Password expired. Please change password:
ru: Срок действия пароля истёк. Смените пароль.

source: Current password:
ru: Текущий пароль:

source: New password:
ru: Новый пароль:

source: Verify new password:
ru: Подтвердите новый пароль:

source: Passwords not provided.
ru: Пароли не были предоставлены.

source: Passwords do not match.
ru: Пароли не совпадают.

source: Current password too long.
ru: Слишком длинный текущий пароль.

source: New password too long.
ru: Слишком длинный новый пароль.

source: Token code request:
ru: Запрос кода токена:

source: Please enter response:
ru: Введите ответ:

source: Please enter your passcode:
ru: Введите код пароля:

source: Please enter your secondary token information:
ru: Введите сведения о вторичном токене:

source: Error creating Pulse connection request
ru: Ошибка создания запроса на подключение Pulse

source: Unexpected response to IF-T/TLS version negotiation:
ru: Непредвиденный ответ на согласование версии IF-T/TLS:

source: IF-T/TLS version from server: %d
ru: Версия IF-T/TLS от сервера: %d

source: Failed to establish EAP-TTLS session
ru: Не удалось создать сеанс EAP-TTLS

source: WARNING: Server provided certificate MD5 does not match its actual certificate.
ru: ПРЕДУПРЕЖДЕНИЕ: MD5 сертификата, предоставленного сервером, не соответствует фактическому сертификату.

source: Authentication failure: Account locked out
ru: Сбой аутентификации: учётная запись заблокирована

source: Authentication failure: Client certificate required
ru: Сбой аутентификации: требуется сертификат клиента

source: Authentication failure: Code 0x%02x
ru: Сбой аутентификации: код 0x%02x

source: Unknown D73 prompt value 0x%x. Will prompt for both username and password.
ru: Неизвестное значение запроса D73: 0x%x. Отправим запрос и на имя пользователя и на пароль.

source: Please report this value and the behaviour of the official client.
ru: Пожалуйста, сообщите об этом значении и опишите поведение официального клиента.

source: Authentication failure: %.*s
ru: Сбой аутентификации: %.*s

source: Pulse server requested Host Checker; not yet supported Try Juniper mode (--protocol=nc)
ru: Сервер Pulse запросил средство проверки хоста ( Host Checker); этот функционал ещё не поддерживается Попробуйте режим Juniper (--protocol=nc)

source: Pulse server is trying to authenticate via EAP-TLS over EAP-TTLS, which we do not know how to handle. This can happen when the server OPTIONALLY accepts TLS client certificates, but your authentication does not require one. You may be able to work around it by spoofing a very old Pulse client with: --useragent="Pulse-Secure/3.0.0" Please report results to <%s>.
ru: Сервер Pulse пытается выполнить аутентификацию с помощью EAP-TLS поверх EAP-TTLS, но мы не можем обрабатывать такие конфигурации. Эта ситуация может возникнуть, если сервер ДОПОЛНИТЕЛЬНО принимает также и сертификаты TLS клиентов, в то время как ваш способ аутентификации их не требует. Возможность обойти эту ситуацию: спуфинг очень старого клиента Pulse с помощью аргумента --useragent="Pulse-Secure/3.0.0" Сообщите о результатах на <%s>.

source: Pulse server requested unexpected EAP type 0x%x
ru: Сервер Pulse запросил непредвиденный тип EAP 0x%x

source: Unhandled Pulse authentication packet, or authentication failure
ru: Пакет аутентификации Pulse не был обработан, либо сбой аутентификации

source: Pulse authentication cookie not accepted
ru: Cookie-файлы аутентификации Pulse не приняты

source: Pulse realm entry
ru: Запись области Pulse

source: Pulse realm choice
ru: Выбор области Pulse

source: Pulse region choice
ru: Выбор региона Pulse

source: Pulse password auth request, code 0x%02x
ru: Запрос пароля Pulse для аутентификации, код 0x%02x

source: Pulse password request with unknown code 0x%02x. Please report.
ru: Запрос пароля Pulse с неизвестным кодом 0x%02x. Пожалуйста, сообщите об этом.

source: Pulse password general token code request
ru: Запрос кода общего токена пароля Pulse

source: Pulse session limit, %d sessions
ru: Ограничение числа сеансов Pulse: %d

source: Unhandled Pulse auth request
ru: Необработанный запрос аутентификации Pulse

source: Unexpected response instead of IF-T/TLS auth success:
ru: Непредвиденный ответ вместо успешной аутентификации IF-T/TLS:

source: EAP-TTLS failure: Flushing output with pending input bytes
ru: Сбой EAP-TTLS: опорожнение выводимых данных с входными байтами в очереди обработки

source: Error creating EAP-TTLS buffer
ru: Ошибка создания буфера EAP-TTLS

source: Failed to read EAP-TTLS Acknowledge: %s
ru: Не удалось прочитать EAP-TTLS Acknowledge: %s

source: Read %d bytes of IF-T/TLS EAP-TTLS record
ru: Чтение %d байт записи IF-T/TLS EAP-TTLS

source: Bad EAP-TTLS Acknowledge packet
ru: Повреждённый пакет EAP-TTLS Acknowledge

source: Bad EAP-TTLS packet (len %d, left %d)
ru: Некорректный пакет EAP-TTLS (длина %d, осталось %d)

source: Unexpected Pulse config packet:
ru: Непредвиденный пакет конфигурации Pulse:

source: Processing Pulse main config packet for server version >= 9.1R14
ru: Обрабатывается пакет основной конфигурации Pulse для версии сервера >= 9.1R14

source: attr_flag 0x2c00: known for Pulse version >= 9.1R14
ru: attr_flag 0x2c00: известен для версии Pulse >= 9.1R14

source: attr_flag 0x2e00: known for Pulse version >= 9.1R16
ru: attr_flag 0x2e00: известен для версии Pulse >= 9.1R16

source: attr_flag 0x%04x: unknown Pulse version. Please report to <%s>
ru: attr_flag 0x%04x: неизвестная версия Pulse. Сообщите об этом на <%s>

source: If any of the above attributes are meaningful, please report to <%s>
ru: Если какие-либо атрибуты выше имеют смысл, сообщите на <%s>

source: Processing Pulse main config packet for server version < 9.1R14
ru: Обрабатывается пакет основной конфигурации Pulse для версии сервера < 9.1R14

source: Receive route of unknown type 0x%08x
ru: Получен маршрут неизвестного типа 0x%08x

source: Processing Pulse ESP config packet
ru: Обрабатывается пакет конфигурации Pulse ESP

source: Invalid ESP config packet:
ru: Недействительный пакет конфигурации ESP:

source: Invalid ESP setup
ru: Недействительные параметры ESP

source: Short IF-T/TLS packet when expecting configuration:
ru: Короткий пакет IF-T/TLS во время ожидания конфигурации:

source: Unexpected IF-T/TLS packet when expecting configuration: wrong vendor
ru: Непредвиденный пакет IF-T/TLS во время ожидания конфигурации: неверный поставщик

source: Unreasonably large IF-T/TLS packet (%u > 1 MiB) when expecting configuration
ru: Необоснованно большой размер пакета IF-T/TLS (%u > 1 МиБ) во время ожидания конфигурации

source: Unexpected Pulse configuration packet: %s
ru: Непредвиденный пакет конфигурации Pulse: %s

source: wrong type field (!= 1)
ru: поле с неверным типом (!= 1)

source: too short
ru: слишком короткий

source: non-zero values at offsets 0x10, 0x14, 0x18, 0x1c, or 0x24
ru: ненулевые значения для смещений 0x10, 0x14, 0x18, 0x1c или 0x24

source: length at offset 0x28 != packet length - 0x10
ru: длина со смещением 0x28 != длине пакета - 0x10

source: identifier at offset 0x20 is unknown
ru: неизвестный идентификатор в смещении 0x20

source: Insufficient configuration found
ru: Обнаружена недостаточная конфигурация

source: ESP rekey failed
ru: Сбой замены ключей ESP

source: Pulse fatal error (reason: %ld): %s
ru: Критическая ошибка Pulse (причина: %ld): %s

source: Unknown Pulse packet of %d bytes (vendor 0x%03x, type 0x%02x, hdr_len %d, ident %d)
ru: Неизвестный пакет Pulse размером в %d байт (поставщик 0x%03x, тип 0x%02x, hdr_len %d, идентификатор %d)

source: Sending IF-T/TLS data packet of %d bytes
ru: Отправляется пакет данных IF-T/TLS размером в %d байт

source: Discard bad split include: "%s"
ru: Не учитываем неверно настроенное включение для раздельного туннелирования: "%s"

source: Discard bad split exclude: "%s"
ru: Не учитываем неверно настроенное исключение для раздельного туннелирования: "%s"
