Repository: GNOME/NetworkManager-openconnect
Catalog: po/*.po
Languages: ru

source: (Error while describing error!)
ru: (Ошибка при описании ошибки)

source: ERROR: Cannot initialize sockets
ru: ОШИБКА: невозможно инициализировать сокеты

source: CRITICAL ERROR: DTLS master secret is uninitialised. Please report this.
ru: КРИТИЧЕСКАЯ ОШИБКА: главный секрет DTLS не был инициализирован. Пожалуйста, сообщите об этой ошибке.

source: Error creating HTTPS CONNECT request
ru: Ошибка создания запроса HTTPS CONNECT

source: Error fetching HTTPS response
ru: Ошибка получения ответа HTTPS

source: VPN service unavailable; reason: %s
ru: Служба VPN недоступна; причина: %s

source: Got inappropriate HTTP CONNECT response: %s
ru: Получен несоответствующий ответ HTTP CONNECT: %s

source: Got CONNECT response: %s
ru: Получен ответ CONNECT: %s

source: No memory for options
ru: Нет памяти для параметров

source: <elided>
ru: <не учитывается>

source: X-DTLS-Session-ID not 64 characters; is: "%s"
ru: Длина X-DTLS-Session-ID не равна 64 символам; длина составляет: "%s"

source: X-DTLS-Session-ID is invalid; is: "%s"
ru: Недействительный X-DTLS-Session-ID; его значение: "%s"

source: Unknown DTLS-Content-Encoding %s
ru: Неизвестная кодировка DTLS-Content-Encoding %s

source: Unknown CSTP-Content-Encoding %s
ru: Неизвестная кодировка CSTP-Content-Encoding %s

source: No MTU received. Aborting
ru: MTU не был получен. Операция прерывается.

source: CSTP connected. DPD %d, Keepalive %d
ru: CSTP подключён. DPD %d, Keepalive %d

source: Ingested STRAP public key %s
ru: Встроенный открытый ключ STRAP %s

source: Compression setup failed
ru: Сбой настройки параметров сжатия

source: Allocation of deflate buffer failed
ru: Не удалось выделить память для буфера распаковки

source: inflate failed
ru: сбой сжатия

source: LZS decompression failed: %s
ru: Сбой распаковки LZS: %s

source: LZ4 decompression failed
ru: Сбой распаковки LZ4

source: Unknown compression type %d
ru: Неизвестный тип сжатия %d

source: Received %s compressed data packet of %d bytes (was %d)
ru: Получен пакет сжатых данных %s размером %d байт (было %d)

source: deflate failed %d
ru: сбой распаковки %d

source: Short packet received (%d bytes)
ru: Получен короткий пакет (%d байт)

source: Unexpected packet length. SSL_read returned %d but packet is
ru: Непредвиденная длина пакета. SSL_read вернул %d, но длина пакета равна

source: Got CSTP DPD request
ru: Получен запрос CSTP DPD

source: Got CSTP DPD response
ru: Получен ответ CSTP DPD

source: Got CSTP Keepalive
ru: Получен CSTP Keepalive

source: Received uncompressed data packet of %d bytes
ru: Получен пакет с несжатыми данными, размер: %d байт

source: Received server disconnect: %02x '%s'
ru: Получен сигнал отключения сервера: %02x '%s'

source: Received server disconnect
ru: Получен сигнал отключения сервера

source: Compressed packet received in !deflate mode
ru: Сжатый пакет получен в режиме !deflate

source: received server terminate packet
ru: от сервера получен пакет прерывания соединения

source: Unknown packet %02x %02x %02x %02x %02x %02x %02x %02x
ru: Неизвестный пакет %02x %02x %02x %02x %02x %02x %02x %02x

source: CSTP Dead Peer Detection detected dead peer!
ru: Обнаружение нерабочих пиров CSTP: обнаружен нерабочий пир.

source: Reconnect failed
ru: Сбой повторного подключения

source: Send CSTP DPD
ru: Отправить CSTP DPD

source: Send CSTP Keepalive
ru: Отправить CSTP Keepalive

source: Sending compressed data packet of %d bytes (was %d)
ru: Отправляется пакет сжатых данных размером %d байт (было %d)

source: Send BYE packet: %s
ru: Отправить пакет BYE: %s

source: Short write writing BYE packet
ru: Недостаточно данных при записи пакета BYE

source: Attempting Digest authentication to proxy
ru: Попытка аутентификации по контрольной сумме на прокси

source: Attempting Digest authentication to server '%s'
ru: Попытка аутентификации по контрольной сумме на сервере «%s»

source: DTLS connection attempted with an existing fd
ru: Попытка подключения DTLS с существующим дескриптором файла

source: No DTLS address
ru: Отсутствует адрес DTLS

source: Server offered no DTLS cipher option
ru: Сервер не предоставил параметров шифрования DTLS

source: No DTLS when connected via proxy
ru: При подключении с помощью прокси DTLS отсутствует

source: DTLS initialised. DPD %d, Keepalive %d
ru: DTLS инициализирован. DPD %d, Keepalive %d

source: Unknown packet (len %d) received: %02x %02x %02x %02x...
ru: Получен неизвестный пакет (длина %d): %02x %02x %02x %02x...

source: TOS this: %d, TOS last: %d
ru: Этот TOS: %d, последний TOS: %d

source: Got DTLS DPD request
ru: Получен запрос DTLS DPD

source: Failed to send DPD response. Expect disconnect
ru: Не удалось отправить ответ DPD. Ожидайте прерывания подключения

source: Got DTLS DPD response
ru: Получен ответ DTLS DPD

source: Got DTLS Keepalive
ru: Получен DTLS Keepalive

source: Compressed DTLS packet received when compression not enabled
ru: Получен сжатый пакет DTLS при отключённых параметрах сжатия

source: Unknown DTLS packet type %02x, len %d
ru: Неизвестный тип пакета DTLS %02x, длина %d

source: Send DTLS Keepalive
ru: Отправить DTLS Keepalive

source: Failed to send keepalive request. Expect disconnect
ru: Не удалось отправить запрос keepalive. Ожидайте прерывания подключения

source: Initiating MTU detection (min=%d, max=%d)
ru: Инициируется обнаружение значения MTU (min=%d, max=%d)

source: Sending MTU DPD probe (%u bytes)
ru: Отправляется проба MTU DPD (%u байт)

source: Failed to send DPD request (%d %d)
ru: Не удалось отправить запрос DPD (%d %d)

source: Too long time in MTU detect loop; assuming negotiated MTU.
ru: Цикл определения MTU длится слишком долго; предполагаем согласованный MTU.

source: Too long time in MTU detect loop; MTU set to %d.
ru: Цикл определения MTU длится слишком долго; устанавливаем MTU %d.

source: Received unexpected packet (type 0x%02x, %d bytes, expected %d) in MTU detection; skipping.
ru: Во время определения MTU был получен непредвиденный пакет (тип 0x%02x, %d байтов, ожидалось %d); пропускаем.

source: Received MTU DPD probe (%u bytes)
ru: Получен результат пробы MTU DPD (%u байт)

source: No response to size %u after %d tries (min %d max %d)
ru: Нет ответа на размер %u после %d проб (мин %d макс %d)

source: Failed to recv DPD request (%d)
ru: Не удалось принять запрос DPD (%d)

source: Detected MTU of %d bytes (was %d)
ru: Обнаружено значение MTU в %d байт (было %d)

source: No change in MTU after detection (was %d)
ru: MTU без изменений после обнаружения (было %d)

source: Accepting expected ESP packet with seq %u
ru: Ожидаемый пакет ESP с последовательностью %u принимается

source: Accepting later-than-expected ESP packet with seq %u (expected %<PRIu64>)
ru: Пакет ESP с последовательностью %u принимается позже, чем ожидалось (ожидалось %<PRIu64>)

source: Discarding ancient ESP packet with seq %u (expected %<PRIu64>)
ru: Устаревший пакет ESP с последовательностью %u не учитывается (ожидалось %<PRIu64>)

source: Tolerating ancient ESP packet with seq %u (expected %<PRIu64>)
ru: Устаревший пакет ESP с последовательностью %u учитывается (ожидалось %<PRIu64>)

source: Discarding replayed ESP packet with seq %u
ru: Повторяющийся пакет ESP с последовательностью не учитывается %u

source: Tolerating replayed ESP packet with seq %u
ru: Повторяющийся пакет ESP с последовательностью %u учитывается

source: Accepting out-of-order ESP packet with seq %u (expected %<PRIu64>)
ru: Нестандартный пакет ESP с последовательностью %u принимается (ожидалось %<PRIu64>)

source: Parameters for %s ESP: SPI 0x%08x
ru: Параметры для %s ESP: SPI 0x%08x

source: ESP encryption type %s key 0x%s
ru: Тип шифрования ESP: %s, ключ 0x%s

source: ESP authentication type %s key 0x%s
ru: Тип аутентификации ESP: %s, ключ 0x%s

source: incoming
ru: входящие

source: outgoing
ru: исходящие

source: Send ESP probes
ru: Отправить пробы ESP

source: ESP receive error: %s
ru: Ошибка получения ESP: %s

source: Received ESP packet from old SPI 0x%x, seq %u
ru: Получен пакет ESP от старого SPI 0x%x, последовательность %u

source: Received ESP packet with invalid SPI 0x%08x
ru: Получен пакет ESP с недействительным SPI 0x%08x

source: Received ESP Legacy IP packet of %d bytes
ru: Получен пакет ESP с IP старого формата: %d байт

source: Received ESP Legacy IP packet of %d bytes (LZO-compressed)
ru: Получен пакет ESP с IP старого формата: %d байт (сжатие LZO)

source: Received ESP IPv6 packet of %d bytes
ru: Получен пакет ESP IPv6: %d байт

source: Received ESP packet of %d bytes with unrecognised payload type %02x
ru: Получен пакет ESP размером %d байт с неопознанным типом полезных данных %02x

source: Invalid padding length %02x in ESP
ru: Недействительная длина заполнения %02x в ESP

source: Invalid padding bytes in ESP
ru: Недействительные байты заполнения в ESP

source: ESP session established with server
ru: С сервером установлен сеанс ESP

source: Failed to allocate memory to decrypt ESP packet
ru: Не удалось выделить память для расшифровки пакета ESP

source: LZO decompression of ESP packet failed
ru: Сбой распаковки архива LZO для пакета ESP

source: LZO decompressed %d bytes into %d
ru: LZO распаковал %d байт в %d

source: Rekey not implemented for ESP
ru: Для ESP замена ключей не реализована

source: ESP detected dead peer
ru: ESP обнаружил нерабочий пир

source: Send ESP probes for DPD
ru: Отправить пробы ESP для DPD

source: Keepalive not implemented for ESP
ru: Keepalive не реализован для ESP

source: Requeueing failed ESP send: %s
ru: Невыполненный ESP send повторно поставлен в очередь: %s

source: Failed to send ESP packet: %s
ru: Сбой отправки пакета ESP: %s

source: Sent ESP IPv%d packet of %d bytes
ru: Отправлен пакет ESP IPv%d: %d байт

source: Failed to generate random keys for ESP
ru: Не удалось создать случайные ключи для ESP

source: Failed to generate initial IV for ESP
ru: Не удалось создать начальный вектор инициализации for ESP

source: WARNING: Unknown F5 JSON form field type '%s', treating as 'text'. Please report to <%s>
ru: ПРЕДУПРЕЖДЕНИЕ: неизвестный тип поля формы F5 JSON «%s», будет обработан как «text». Сообщите об этой ошибке в <%s>.

source: WARNING: No HTML authentication form found. Extracted form from F5's embedded JSON. This is EXPERIMENTAL. Please report results to <%s>.
ru: ПРЕДУПРЕЖДЕНИЕ: не найдено форм аутентификации HTML. Форма извлекается из встроенного JSON F5 Данный функционал является ЭКСПЕРИМЕНТАЛЬНЫМ. Сообщите о его результатах на <%s>.

source: WARNING: no HTML login form found; assuming username and password fields
ru: ПРЕДУПРЕЖДЕНИЕ: не найдено форм HTML для входа; предполагаем формат в виде полей имени пользователя и пароля

source: Unknown form ID '%s' (expected 'auth_form')
ru: Неизвестная форма ID '%s' (ожидалась «auth_form»)

source: Failed to parse F5 profile response
ru: Не удалось проанализировать ответ профиля F5

source: Failed to find VPN profile parameters
ru: Не удалось найти параметры профиля VPN

source: Failed to parse F5 options response
ru: Не удалось проанализировать ответ параметров F5

source: Idle timeout is %d minutes
ru: Истечение времени ожидания бездействия: %d мин.

source: Got default routes
ru: Получены маршруты по умолчанию

source: Got SplitTunneling0 value of %d
ru: Получено значение SplitTunneling0 для %d

source: Got DNS server %s
ru: Получена запись сервера %s

source: Got WINS/NBNS server %s
ru: Получен сервер WINS/NBNS %s

source: Got search domain %s
ru: Получен домен поиска %s

source: Got split exclude route %s
ru: Получен включаемый маршрут %s для раздельного туннелирования

source: Got split include route %s
ru: Получен исключаемый маршрут %s для раздельного туннелирования

source: DTLS is enabled on port %d
ru: DTLS включён на порту %d

source: WARNING: Server enables DTLS, but also requires HDLC. Disabling DTLS, because HDLC prevents determination of efficient and consistent MTU.
ru: ПРЕДУПРЕЖДЕНИЕ: сервер использует DTLS, но также требует HDLC. Отключаем DTLS, т.к. HDLC препятствует определению эффективного и неизменяемого MTU.

source: Failed to find VPN options
ru: Не удалось найти параметры VPN

source: Got Legacy IP address %s
ru: Получен адрес IP в старом формате %s

source: Got IPv6 address %s
ru: Получен адрес IPv6 %s

source: Got profile parameters '%s'
ru: Получены параметры профиля «%s»

source: Got ipv4 %d ipv6 %d hdlc %d ur_Z '%s'
ru: Получено ipv4 %d ipv6 %d hdlc %d ur_Z '%s'

source: Error establishing F5 connection
ru: Ошибка установки подключения F5

source: Got login realm '%s'
ru: Получена область входа'%s'

source: Invalid credentials; try again.
ru: Недействительные учётные данные; повторите попытку.

source: Got IPv%d exclude route %s
ru: Получен исключаемый маршрут IPv%d %s для раздельного туннелирования

source: Got IPv%d route %s
ru: Получен маршрут IPv%d %s

source: Failed to parse Fortinet config XML
ru: Сбой анализа файла XML конфигурации Fortinet

source: Idle timeout is %d minutes.
ru: Истечение времени ожидания бездействия: %d мин.

source: Server reports that reconnect-after-drop is allowed within %d seconds, %s
ru: Сервер сообщает, что reconnect-after-drop допускается в пределах %d сек., %s

source: but only from the same source IP address
ru: но только с того же начального адреса IP

source: even if source IP address changes
ru: даже если начальный адрес IP изменился

source: Server reports that reconnect-after-drop is not allowed. OpenConnect will not be able to reconnect if dead peer is detected. If reconnection DOES work, please report to <%s>
ru: Сервер сообщает, что reconnect-after-drop не разрешается. OpenConnect не сможет возобновить подключение при обнаружении нерабочих пиров. Если повторное подключение всё же будет УДАЧНЫМ, пожалуйста, сообщите об этом на <%s>

source: Reported platform is %s
ru: Сообщение: платформа %s

source: Got IPv%d DNS server %s
ru: Получен сервер DNS IPv%d %s

source: WARNING: Got split-DNS domains %s (not yet implemented)
ru: ПРЕДУПРЕЖДЕНИЕ: получены домены split-DNS %s (функционал ещё не реализован)

source: WARNING: Got split-DNS server %s (not yet implemented)
ru: ПРЕДУПРЕЖДЕНИЕ: получен сервер split-DNS %s (функционал ещё не реализован)

source: WARNING: Fortinet server does not specifically enable or disable reconnection without reauthentication. If automatic reconnection does work, please report results to <%s>
ru: ПРЕДУПРЕЖДЕНИЕ: сервер Fortinet не включает и не отключает возобновление конкретных подключений без повторной аутентификации. В случае успешных автоматических возобновлений подключений сообщите о результатах на <%s>

source: Server did not send <auth-ses tun-connect-without-reauth="0/1"/>. OpenConnect will probably not be able to reconnect if dead peer is detected. If reconnection DOES, work please report to <%s>
ru: Сервер не отправил <auth-ses tun-connect-without-reauth="0/1"/>. Скорее всего, OpenConnect не сможет возобновить подключение при обнаружении нерабочих пиров. Если повторное подключение будет УСПЕШНЫМ, пожалуйста, сообщите об этом на <%s>

source: Received split routes; not setting default Legacy IP route
ru: Получены маршруты для раздельного туннелирования; маршруты по умолчанию для старого формата IP не будут настроены

source: No split routes received; setting default Legacy IP route
ru: Маршруты для раздельного туннелирования не получены; будет настроен маршрут по умолчанию для IP старого формата

source: Ancient Fortinet server (<v5?) only supports ancient HTML config, which is not implemented by OpenConnect.
ru: Устаревший сервер Fortinet (<v5?) поддерживает только устарвешие конфигурации HTML, которые не реализованы в OpenConnect.

source: Fortinet server is rejecting request for connection options. This has been observed after reconnection in some cases. Please report to <%s>, or see the discussions on %s and %s.
ru: Сервер Fortinet не принимает запросы о параметрах подключения. Это поведение наблюдалось в некоторых случаях после возобновления подключений. Сообщите об этих случаях на <%s>, либо присоединяйтесь к дискуссиям на %s и %s.

source: Error establishing Fortinet connection
ru: Ошибка установки подключения Fortinet

source: No cookie named SVPNCOOKIE.
ru: Нет cookie-файла с именем SVPNCOOKIE.

source: Did not receive expected svrhello response.
ru: Ожидаемый ответ svrhello не был получен.

source: svrhello status was "%.*s" rather than "ok"
ru: Статус svrhello был "%.*s" вместо "ok"

source: Deferring DTLS resumption until CSTP generates a PSK
ru: Возобновление DTLS откладывается до момента, когда CSTP создаст ключ PSK

source: Failed to generate DTLS priority string
ru: Не удалось создать строку приоритета DTLS

source: Failed to set DTLS priority: '%s': %s
ru: Не удалось указать приоритет DTLS: '%s': %s

source: Failed to allocate credentials: %s
ru: Не удалось выделить память для учётных данных: %s

source: Failed to generate DTLS key: %s
ru: Не удалось создать ключ DTLS: %s

source: Failed to set DTLS key: %s
ru: Не удалось настроить ключ DTLS: %s

source: Failed to set DTLS PSK credentials: %s
ru: Не удалось настроить учётные данные для ключа PSK DTLS: %s

source: Unknown DTLS parameters for requested CipherSuite '%s'
ru: Неизвестные параметры DTLS для запрошенного CipherSuite '%s'

source: Failed to set DTLS session parameters: %s
ru: Не удалось настроить параметры сеанса DTLS: %s

source: GnuTLS used %d ClientHello random bytes; this should never happen
ru: GnuTLS использовал %d произвольных байтов ClientHello; этого не должно происходить

source: GnuTLS sent insecure ClientHello random. Upgrade to 3.6.13 or newer.
ru: GnuTLS послал незащищённый произвольный ClientHello. Обновитесь до версии 3.6.13 или более свежей.

source: Failed to initialize DTLS: %s
ru: Не удалось инициализировать DTLS: %s

source: Peer MTU %d too small to allow DTLS
ru: Слишком низкое значение MTU пира %d не позволяет разрешить DTLS

source: DTLS MTU reduced to %d
ru: DTLS MTU снижено до %d

source: DTLS session resume failed; possible MITM attack. Disabling DTLS.
ru: Не удалось возобновить сеанс DTLS; возможна атака MITM. Отключаем DTLS.

source: Failed to set DTLS MTU: %s
ru: Не удалось настроить DTLS MTU: %s

source: Established DTLS connection (using GnuTLS). Ciphersuite %s.
ru: Подключение DTLS установлено (с использованием GnuTLS). Ciphersuite %s.

source: DTLS connection compression using %s.
ru: Сжатое подключение DTLS с использованием %s.

source: DTLS handshake timed out
ru: Истекло время ожидания DTLS handshake

source: DTLS handshake failed: %s
ru: Сбой DTLS handshake: %s

source: (Is a firewall preventing you from sending UDP packets?)
ru: (Межсетевой экран запрещает отправку пакетов UDP?)

source: Failed to initialise ESP cipher: %s
ru: Сбой инициализации шифра ESP: %s

source: Failed to initialize ESP HMAC: %s
ru: Не удалось инициализировать HMAC ESP: %s

source: Failed to calculate HMAC for ESP packet: %s
ru: Не удалось рассчитать HMAC для пакета ESP: %s

source: Received ESP packet with invalid HMAC
ru: Получен пакет ESP с недействительным HMAC

source: Decrypting ESP packet failed: %s
ru: Не удалось расшифровать пакет ESP: %s

source: Failed to encrypt ESP packet: %s
ru: Не удалось зашифровать пакет ESP: %s

source: Failed select() for TLS
ru: Сбой select() для TLS

source: TLS/DTLS write cancelled
ru: Отмена записи TLS/DTLS

source: Failed to write to TLS/DTLS socket: %s
ru: Сбой записи в сокет TLS/DTLS: %s

source: Failed select() for TLS/DTLS
ru: Сбой select() для TLS/DTLS

source: TLS/DTLS read cancelled
ru: Чтение TLS/DTLS отменено

source: TLS/DTLS socket closed uncleanly
ru: Некорректное закрытие сокета TLS/DTLS

source: Failed to read from TLS/DTLS socket: %s
ru: Не удалось прочитать сокет TLS/DTLS: %s

source: Attempted to read from non-existent %s session
ru: Попытка чтения данных из несуществующего сеанса %s

source: Read error on %s session: %s
ru: Ошибка чтения в сеансе %s: %s

source: Attempted to write to non-existent %s session
ru: Попытка записи в несуществующий сеанс %s

source: Write error on %s session: %s
ru: Ошибка записи в сеансе %s: %s

source: Could not extract expiration time of certificate
ru: Не удалось получить дату окончания действия сертификата

source: Client certificate has expired at
ru: Срок действия сертификата уже истёк:

source: Secondary client certificate has expired at
ru: Срок действия вторичного клиентского сертификата уже истёк:

source: Client certificate expires soon at
ru: Срок действия сертификата скоро истечёт:

source: Secondary client certificate expires soon at
ru: Срок действия вторичного клиентского сертификата скоро истечёт:

source: Failed to load item '%s' from keystore: %s
ru: Не удалось загрузить элемент «%s» из хранилища ключей: %s

source: Failed to open key/certificate file %s: %s
ru: Не удалось открыть файл ключа/сертификата %s: %s

source: Failed to stat key/certificate file %s: %s
ru: Не удалось получить статистику для файла ключа/сертификата %s: %s

source: Failed to allocate certificate buffer
ru: Не удалось выделить память для буфера сертификата

source: Failed to read certificate into memory: %s
ru: Не удалось прочитать сертификат в память: %s

source: Failed to setup PKCS#12 data structure: %s
ru: Не удалось настроить структуру данных PKCS#12: %s

source: Failed to decrypt PKCS#12 certificate file
ru: Не удалось расшифровать файл сертификата PKCS#12

source: Enter PKCS#12 pass phrase:
ru: Введите парольную фразу PKCS#12:

source: Enter secondary PKCS#12 pass phrase:
ru: Введите вторичную парольную фразу PKCS#12:

source: Failed to process PKCS#12 file: %s
ru: Не удалось обработать файл PKCS#12: %s

source: Failed to load PKCS#12 certificate: %s
ru: Не удалось загрузить сертификат PKCS#12: %s

source: Failed to load secondary PKCS#12 certificate: %s
ru: Не удалось загрузить вторичный сертификат PKCS#12: %s

source: Could not initialise MD5 hash: %s
ru: Не удалось инициализировать хэш MD5: %s

source: MD5 hash error: %s
ru: Ошибка хэша MD5: %s

source: Missing DEK-Info: header from OpenSSL encrypted key
ru: В зашифрованном ключе OpenSSL отсутствует заголовок DEK-Info:

source: Cannot determine PEM encryption type
ru: Не удалось определить тип шифрования PEM

source: Unsupported PEM encryption type: %s
ru: Неподдерживаемый тип шифрования PEM: %s

source: Invalid salt in encrypted PEM file
ru: Недействительная соль в зашифрованном файле PEM file

source: Error base64-decoding encrypted PEM file: %s
ru: Ошибка расшифровки файла PEM по стандарту base64: %s

source: Encrypted PEM file too short
ru: Слишком короткий зашифрованный файл PEM

source: Failed to initialise cipher for decrypting PEM file: %s
ru: Сбой инициализации шифра для расшифровки файла PEM: %s

source: Failed to decrypt PEM key: %s
ru: Не удалось расшифровать ключ PEM: %s

source: Decrypting PEM key failed
ru: Сбой расшифровки ключа PEM

source: Enter PEM pass phrase:
ru: Введите парольную фразу PEM:

source: Enter secondary PEM pass phrase:
ru: Введите вторичную парольную фразу PEM:

source: This binary built without system key support
ru: Этот бинарный файл собран без поддержки общесистемных ключей

source: This binary built without PKCS#11 support
ru: Этот бинарный файл собран без поддержки PKCS#11

source: Using PKCS#11 certificate %s
ru: Используется сертификат PKCS#11 %s

source: Using system certificate %s
ru: Используется системный сертификат %s

source: Error loading certificate from PKCS#11: %s
ru: Ошибка загрузки сертификата из PKCS#11: %s

source: Error loading system certificate: %s
ru: Ошибка загрузки системного сертификата: %s

source: Using certificate file %s
ru: Используется файл сертификата %s

source: Using secondary certificate file %s
ru: Используется файл вторичного сертификата %s

source: PKCS#11 file contained no certificate
ru: Файл PKCS#11 не содержал сертификатов

source: No certificate found in file
ru: Сертификаты в файле не найдены

source: Loading certificate failed: %s
ru: Сбой загрузки сертификата: %s
