Repository: GNOME/NetworkManager-openconnect
Catalog: po/*.po
Languages: ru

source: Loading secondary certificate failed: %s
ru: Сбой загрузки вторичного сертификата: %s

source: Using system key %s
ru: Используется системный ключ %s

source: Using secondary system key %s
ru: Используется вторичный системный ключ %s

source: Error initialising private key structure: %s
ru: Ошибка инициализации структуры частного ключа: %s

source: Error importing system key %s: %s
ru: Ошибка импорта системного ключа %s: %s

source: Trying PKCS#11 key URL %s
ru: Пробуем URL %s ключа PKCS#11

source: Error initialising PKCS#11 key structure: %s
ru: Ошибка инициализации структуры ключа PKCS#11: %s

source: Error importing PKCS#11 URL %s: %s
ru: Ошибка импорта URL %s для PKCS#11: %s

source: Using PKCS#11 key %s
ru: Используется ключ PKCS#11 %s

source: Error importing PKCS#11 key into private key structure: %s
ru: Ошибка импорта ключа PKCS#11 в структуру закрытого ключа: %s

source: Using private key file %s
ru: Используется файл закрытого ключа %s

source: This version of OpenConnect was built without TPM support
ru: Эта версия OpenConnect была собрана без поддержки модулей TPM

source: This version of OpenConnect was built without TPM2 support
ru: Эта версия OpenConnect была собрана без поддержки модулей TPM2

source: Failed to interpret PEM file
ru: Не удалось интерпретировать файл PEM

source: Failed to load PKCS#1 private key: %s
ru: Не удалось загрузить закрытый ключ PKCS#1: %s

source: Failed to load private key as PKCS#8: %s
ru: Не удалось загрузить закрытый ключ в виде PKCS#8: %s

source: Failed to decrypt PKCS#8 certificate file
ru: Не удалось расшифровать файл сертификата PKCS#8

source: Failed to determine type of private key %s
ru: Не удалось определить тип закрытого ключа %s

source: Enter PKCS#8 pass phrase:
ru: Введите парольную фразу PKCS#8:

source: Failed to get key ID: %s
ru: Не удалось получить идентификатор ключа: %s

source: Error signing test data with private key: %s
ru: Ошибка подписания тестовых данных закрытым ключом: %s

source: Error validating signature against certificate: %s
ru: Ошибка сравнения подписи с подписью сертификата: %s

source: No SSL certificate found to match private key
ru: Не найдено сертификатов SSL, соответствующих закрытому ключу

source: No secondary certificate found to match private key
ru: Не найдено вторичных сертификатов, соответствующих закрытому ключу

source: got_key conditions not met!
ru: Не соблюдены условия got_key

source: Error creating an abstract privkey from /x509_privkey: %s
ru: Ошибка создания абстрактного закрытого ключа на базе /x509_privkey: %s

source: Using client certificate '%s'
ru: Используется сертификат клиента '%s'

source: Using secondary certificate '%s'
ru: Используется вторичный сертификат '%s'

source: Failed to allocate memory for certificate
ru: Не удалось выделить память для сертификата

source: Got no issuer from PKCS#11
ru: Сведения об издателе не были получены из PKCS#11

source: Got next CA '%s' from PKCS#11
ru: Получен следующий CA «%s» из PKCS#11

source: Failed to allocate memory for supporting certificates
ru: Не удалось выделить память для поддерживаемых сертификатов

source: Adding supporting CA '%s'
ru: Добавляется поддерживающий CA '%s'

source: Importing X509 certificate failed: %s
ru: Сбой импорта сертификата X509: %s

source: Setting PKCS#11 certificate failed: %s
ru: Сбой настройки сертификата PKCS#11: %s

source: Setting certificate revocation list failed: %s
ru: Не удалось настроить список отозванных сертификатов: %s

source: Private key appears not to support RSA-PSS. Disabling TLSv1.3
ru: Похоже, что закрытый ключ не поддерживает RSA-PSS. Отключаем TLSv1.3

source: Setting certificate failed: %s
ru: Сбой настройки сертификата: %s

source: Server presented no certificate
ru: Сервер не представил сертификатов

source: Error comparing server's cert on rehandshake: %s
ru: Ошибка сравнения сертификатов сервера при повторном согласовании подключения: %s

source: Server presented different cert on rehandshake
ru: При повторном согласовании подключения сервер представил другой сертификат

source: Server presented identical cert on rehandshake
ru: При повторном согласовании подключения сервер представил идентичный сертификат

source: Error initialising X509 cert structure
ru: Ошибка инициализации структуры сертификата X509

source: Error importing server's cert
ru: Ошибка импорта сертификата сервера

source: Could not calculate hash of server's certificate
ru: Не удалось вычислить хэш сертификата сервера

source: Error checking server cert status
ru: Ошибка проверки статуса сертификата сервера

source: certificate revoked
ru: сертификат отозван

source: signer not found
ru: подписывающий сертификат не найден

source: signer not a CA certificate
ru: подписывающий сертификат не является сертификатом ЦС

source: insecure algorithm
ru: нестойкий алгоритм

source: certificate not yet activated
ru: сертификат ещё не активирован

source: certificate expired
ru: срок действия сертификата истёк

source: signature verification failed
ru: сбой проверки подлинности подписи

source: certificate does not match SNI
ru: сертификат не соответствует расширению SNI

source: certificate does not match hostname
ru: сертификат не соответствует имени хоста

source: Server certificate verify failed: %s
ru: Не удалось проверить подлинность сертификата сервера: %s

source: TLS Finished message larger than expected (%u bytes)
ru: Размер законченного сообщения TLS больше, чем ожидалось (%u байт)

source: Failed to allocate memory for cafile certs
ru: Не удалось выделить память для сертификатов cafile

source: Failed to read certs from cafile: %s
ru: Не удалось прочитать сертификаты из cafile: %s

source: Failed to open CA file '%s': %s
ru: Не удалось открыть файл CA «%s»: %s

source: Loading certificate failed. Aborting.
ru: Сбой загрузки сертификата. Операция прерывается.

source: Failed to construct GnuTLS priority string
ru: Не удалось создать строку приоритета GnuTLS

source: Failed to set GnuTLS priority string ("%s"): %s
ru: Не удалось настроить строку приоритета GnuTLS ("%s"): %s

source: SSL negotiation with %s
ru: Согласование SSL с %s

source: SSL connection cancelled
ru: Отмена подключения SSL

source: SSL connection failure due to fatal alert: %s
ru: Отказ подключения SSL в связи с критичным предупреждением: %s

source: SSL connection failure: %s
ru: Отказ подключения SSL: %s

source: GnuTLS non-fatal return during handshake: %s
ru: Некритичное состояние возврата GnuTLS во время согласования подключения: %s

source: Connected to HTTPS on %s with ciphersuite %s
ru: Подключено к HTTPS на %s с комплексом шифрования %s

source: Renegotiated SSL on %s with ciphersuite %s
ru: Выполнено повторное согласование SSL на %s с комплексом шифрования %s

source: PIN required for %s
ru: Для %s требуется PIN

source: Wrong PIN
ru: Неверный PIN

source: This is the final try before locking!
ru: Последняя попытка перед блокировкой!

source: Only a few tries left before locking!
ru: Осталось несколько попыток до блокировки!

source: Enter PIN:
ru: Введите PIN:

source: Unsupported OATH HMAC algorithm
ru: Неподдерживаемый алгоритм OATH HMAC

source: Failed to calculate OATH HMAC: %s
ru: Не удалось рассчитать OATH HMAC: %s

source: Could not set ciphersuites: %s
ru: Не удалось настроить комплексы шифрования: %s

source: Established EAP-TTLS session
ru: Установлен сеанс EAP-TTLS

source: Failed to generate STRAP key: %s
ru: Не удалось создать ключ STRAP: %s

source: Failed to generate STRAP DH key: %s
ru: Не удалось создать ключ STRAP DH: %s

source: Failed to decode server DH key: %s
ru: Не удалось расшифровать ключ DH: %s

source: Failed to export DH private key parameters: %s
ru: Не удалось экспортировать параметры закрытого ключа DH: %s

source: Failed to export server DH key parameters: %s
ru: Не удалось экспортировать параметры закрытого ключа DH сервера: %s

source: HPKE uses unsupported EC curve (%d, %d)
ru: HPKE использует неподдерживаемую эллиптическую кривую (%d, %d)

source: Failed to create ECC public point for ECDH
ru: Не удалось создать общедоступную точку ECC для ECDH

source: HKDF extract failed: %s
ru: Сбой извлечения функции HKDF: %s

source: HKDF expand failed: %s
ru: Сбой развёртывания функции HKDF: %s

source: Failed to init AES-256-GCM cipher: %s
ru: Не удалось инициализировать шифр AES-256-GCM: %s

source: SSO token decryption failed: %s
ru: Не удалось расшифровать токен единого входа: %s

source: Failed to decode STRAP key: %s
ru: Не удалось расшифровать ключ STRAP: %s

source: Failed to generate channel bindings for STRAP key: %s
ru: Не удалось создать привязки канала для ключа STRAP: %s

source: Failed to regenerate STRAP key: %s
ru: Не удалось повторно создать ключ STRAP: %s

source: Failed to generate STRAP key DER
ru: Не удалось создать правила DER для ключа STRAP

source: STRAP signature failed: %s
ru: Не удалось подписать STRAP: %s

source: Certificate may be multiple certificate authentication incompatible.
ru: Сертификат может быть несовместим с методом аутентификации по нескольким сертификатам.

source: The certificate specifies key usages incompatible with authentication.
ru: Сертификат устанавливает метод использования ключей, несовместимый с аутентификацией

source: Certificate doesn't specify key usage.
ru: Сертификат не устанавливает метод использования ключей

source: Precondition failed %s[%s]:%d
ru: Предварительное условие не выполнено %s[%s]:%d

source: Failed to generate the PKCS#7 structure: %s.
ru: Не удалось создать структуру PKCS#7: %s.

source: Precondition failed %s[%s]:%d.
ru: Предварительное условие не выполнено %s[%s]:%d.

source: Failed to sign data with second certificate: %s.
ru: Не удалось подписать данные вторым сертификатом: %s.

source: TPM sign function called for %d bytes.
ru: Функция подписания модулем TPM вызвана для %d байтов.

source: Failed to create TPM hash object: %s
ru: Не удалось создать хэш-объект TPM: %s

source: Failed to set value in TPM hash object: %s
ru: Не удалось настроить значение в хэш-объекте TPM: %s

source: TPM hash signature failed: %s
ru: Сбой подписания хэша модулем TPM: %s

source: Error decoding TSS key blob: %s
ru: Ошибка расшифровки блоба ключа TSS: %s

source: Error in TSS key blob
ru: Ошибка в блобе ключа TSS

source: Failed to create TPM context: %s
ru: Не удалось создать контекст TPM: %s

source: Failed to connect TPM context: %s
ru: Не удалось подключить контекст TPM: %s

source: Failed to load TPM SRK key: %s
ru: Не удалось загрузить ключ TPM SRK: %s

source: Failed to load TPM SRK policy object: %s
ru: Не удалось загрузить объект политики TPM SRK: %s

source: Failed to set TPM PIN: %s
ru: Не удалось настроить TPM PIN: %s

source: Failed to load TPM key blob: %s
ru: Не удалось загрузить блоб ключа TPM: %s

source: Enter TPM SRK PIN:
ru: Введите TPM SRK PIN:

source: Failed to create key policy object: %s
ru: Не удалось создать объект политики ключей: %s

source: Failed to assign policy to key: %s
ru: Не удалось присвоить политику ключу: %s

source: Enter TPM key PIN:
ru: Введите PIN ключа TPM:

source: Enter secondary key TPM PIN:
ru: Введите PIN вторичного ключа TPM:

source: Failed to set key PIN: %s
ru: Не удалось настроить PIN ключа: %s

source: Unknown TPM2 EC digest size %d
ru: Неизвестный размер контрольной суммы элл. кривой TPM2: %d

source: Not supporting EC sign algo %s
ru: Поддержка алгоритма подписи EC %s отсутствует

source: Error decoding TSS2 key blob: %s
ru: Ошибка расшифровки блоба ключа TSS2: %s

source: Failed to create ASN.1 type for TPM2: %s
ru: Не удалось создать тип ASN.1 для TPM2: %s

source: Failed to decode TPM2 key ASN.1: %s
ru: Не удалось расшифровать ключ TPM2 ASN.1: %s

source: Failed to parse TPM2 key type OID: %s
ru: Не удалось проанализировать тип ключа TPM2 OID: %s

source: TPM2 key has unknown type OID %s not %s
ru: У ключа TPM2 неизвестный тип OID: %s, а не %s

source: Failed to parse TPM2 key parent: %s
ru: Не удалось проанализировать родительский элемент ключа TPM2: %s

source: Failed to parse TPM2 pubkey element
ru: Не удалось проанализировать элемент открытого ключа TPM2: s

source: Failed to parse TPM2 privkey element
ru: Не удалось проанализировать элемент закрытого ключа TPM2: s

source: Parsed TPM2 key with parent %x, emptyauth %d
ru: Проанализирован ключ TPM2 с родительским элементом %x, emptyauth %d

source: TPM2 digest too large: %d > %d
ru: Слишком большая контрольная сумма TPM2: %d > %d

source: PSS encoding failed; hash size %d too large for RSA key %d
ru: Сбой кодирования PSS; слишком большой размер хэша %d для ключа RSA %d

source: TPMv2 RSA sign called for unknown algorithm %s
ru: Подписание TPMv2 RSA вызвано для неизвестного алгоритма %s

source: TPM2 password too long; truncating
ru: Слишком длинный пароль TPM2; обрезается

source: owner
ru: владелец

source: endorsement
ru: подтверждение

source: platform
ru: платформа

source: Creating primary key under %s hierarchy.
ru: Создаётся первичный ключ в иерархии %s.

source: Enter TPM2 %s hierarchy password:
ru: Введите пароль для иерархии TPM2 %s:

source: TPM2 Esys_TR_SetAuth failed: 0x%x
ru: Сбой TPM2 Esys_TR_SetAuth: 0x%x

source: TPM2 Esys_CreatePrimary owner auth failed
ru: Сбой аутентификации владельца Esys_CreatePrimary TPM2

source: TPM2 Esys_CreatePrimary failed: 0x%x
ru: Сбой TPM2 Esys_CreatePrimary: 0x%x

source: Establishing connection with TPM.
ru: Устанавливается подключение к TPM.

source: TPM2 Esys_Initialize failed: 0x%x
ru: Сбой TPM2 Esys_Initialize: 0x%x

source: TPM2 was already started up thus false positive failing in tpm2tss log.
ru: TPM2 уже был запущен, поэтому ложное срабатывание попало в журнал tpm2tss.

source: TPM2 Esys_Startup failed: 0x%x
ru: Сбой TPM2 Esys_Startup: 0x%x

source: Esys_TR_FromTPMPublic failed for handle 0x%x: 0x%x
ru: Esys_TR_FromTPMPublic не смог обработать 0x%x: 0x%x

source: Enter TPM2 parent key password:
ru: Введите пароль родительского ключа TPM2:

source: Enter secondary TPM2 parent key password:
ru: Введите вторичный пароль родительского ключа TPM2:

source: Loading TPM2 key blob, parent %x.
ru: Идёт загрузка блоба ключа TPM2, родитель %x.

source: TPM2 Esys_Load auth failed
ru: Сбой аутентификации TPM2 Esys_Load

source: TPM2 Esys_Load failed: 0x%x
ru: Сбой TPM2 Esys_Load: 0x%x

source: TPM2 Esys_FlushContext for generated primary failed: 0x%x
ru: Сбой Esys_FlushContext TPM2 для созданного первичного ключа: 0x%x

source: Enter secondary TPM2 key password:
ru: Введите вторичный пароль ключа TPM2:

source: TPM2 RSA sign function called for %d bytes, algo %s
ru: Функция подписания TPM2 RSA вызвана для %d байт, алгоритм %s

source: TPM2 Esys_RSA_Decrypt auth failed
ru: Сбой аутентификации TPM2 Esys_RSA_Decrypt

source: TPM2 failed to generate RSA signature: 0x%x
ru: TPM2 не удалось создать подпись RSA: 0x%x

source: TPM2 EC sign function called for %d bytes.
ru: Функция подписания TPM2 EC вызвана для %d байт

source: Unknown TPM2 EC digest size %d for algo 0x%x
ru: Неизвестный размер %d контрольной суммы элл. кривой TPM2 для алгоритма 0x%x

source: TPM2 Esys_Sign auth failed
ru: Сбой аутентификации Esys_Sign TPM2

source: Invalid TPM2 parent handle 0x%08x
ru: Недействительный обработчик родительского элемента TPM2 0x%08x

source: Using SWTPM due to TPM_INTERFACE_TYPE environment variable
ru: Используется SWTPM т.к. настроена переменная среды TPM_INTERFACE_TYPE

source: TSS2_TctiLdr_Initialize failed for swtpm: 0x%x
ru: Сбой TSS2_TctiLdr_Initialize для swtpm: 0x%x

source: Failed to import TPM2 private key data: 0x%x
ru: Не удалось импортировать данные закрытого ключа TPM2: 0x%x

source: Failed to import TPM2 public key data: 0x%x
ru: Не удалось импортировать данные открытого ключа TPM2: 0x%x

source: Unsupported TPM2 key type %d
ru: Неподдерживаемый тип ключа TPM2: %d

source: TPM2 operation %s failed (%d): %s%s%s
ru: Сбой операции TPM2 %s (%d): %s%s%s

source: Challenge: %s
ru: Вызов (challenge): %s

source: Failed to parse non-XML server response
ru: Не удалось проанализировать ответ сервера не в формате XML

source: Response was: %s
ru: Ответ был: %s

source: Failed to parse XML server response
ru: Не удалось проанализировать ответ сервера в формате XML

source: Unknown ESP MAC algorithm: %s
ru: Неизвестный алгоритм ESP MAC: %s

source: Unknown ESP encryption algorithm: %s
ru: Неизвестный алгоритм шифрования ESP: %s

source: WARNING: Config XML contains <quarantine> tag with value of "%s". VPN connectivity may be disabled or limited.
ru: ПРЕДУПРЕЖДЕНИЕ: Config XML содержит тег <quarantine> со значением "%s". Возможность соединения VPN может быть отключена или ограничена.

source: Non-standard SSL tunnel path: %s
ru: Нестандартный путь к тоннелю SSL: %s

source: Tunnel timeout (rekey interval) is %d minutes.
ru: Истечение времени ожидания тоннеля (интервал между заменой ключей): %d мин.

source: Legacy IP gateway address in config XML (%s) differs from external gateway address (%s).
ru: Адрес IP шлюза в старом формате в конфигурационном XML (%s) отличается от адреса внешнего шлюза (%s).

source: IPv6 gateway address in config XML (%s) differs from external gateway address (%s).
ru: Адрес IPv6 шлюза в конфигурационном XML (%s) отличается от адреса внешнего шлюза (%s).

source: Config XML <connected-gw-ip> address (%s) differs from external gateway address (%s). Please report this to <%s>, including any problems with ESP or other apparent loss of connectivity or performance.
ru: Адрес из конфигурационного XML <connected-gw-ip> (%s) отличается от адреса внешнего шлюза (%s). Сообщите об этом на <%s>, включая сведения о любых проблемах с ESP или о любых других явных сбоях подключений или потерях производительности.

source: GlobalProtect config sent ipsec-mode=%s (expected esp-tunnel)
ru: Конфигурация GlobalProtect отправила ipsec-mode=%s (ожидался esp-tunnel)

source: Ignoring ESP keys since ESP support not available in this build
ru: Ключи ESP игнорируются, т.к. в данной сборке поддержка ESP отсутствует

source: Potential IPv6-related GlobalProtect config tag <%s>: %s
ru: Тег <%s> конфигурации GlobalProtect, возможно связанный с IPv6: %s

source: Unknown GlobalProtect config tag <%s>: %s
ru: Неизвестный тег конфигурации GlobalProtect <%s>: %s

source: GlobalProtect IPv6 support is experimental. Please report results to <%s>.
ru: Поддержка GlobalProtect IPv6 является экспериментальной. Пожалуйста, сообщите о результатах на <%s>.

source: Did not receive ESP keys and matching gateway in GlobalProtect config; tunnel will be TLS only.
ru: Из конфигурации GlobalProtec не были получены ключи ESP и соответствующий шлюз; тоннель будет только с TLS.

source: ESP disabled
ru: ESP отключён

source: No ESP keys received
ru: Ключи ESP не были получены

source: ESP support not available in this build
ru: В данной сборке поддержка ESP отсутствует

source: No MTU received. Calculated %d for %s%s
ru: MTU не был получен. Вычисленное значение: %d для %s%s

source: Connecting to HTTPS tunnel endpoint ...
ru: Идёт подключение к конечной точке тоннеля HTTPS ...

source: Error fetching GET-tunnel HTTPS response.
ru: Ошибка при получении ответа HTTPS GET-tunnel .

source: Gateway disconnected immediately after GET-tunnel request.
ru: Шлюз отключился сразу после запроса GET-tunnel.

source: Got unexpected HTTP response: %.*s
ru: Подучен непредвиденный ответ HTTP: %.*s

source: WARNING: Server asked us to submit HIP report with md5sum %s. VPN connectivity may be disabled or limited without HIP report submission. %s
ru: ПРЕДУПРЕЖДЕНИЕ: сервер просит нас предоставить отчёт HIP с md5sum %s. Без отправки отчёта HIP возможность соединения VPN может быть ограничена или отключена. %s

source: However, running the HIP report submission script on this platform is not yet implemented.
ru: Но выполнение сценария для отправки отчёта HIP ещё не реализовано на данной платформе.

source: You need to provide a --csd-wrapper argument with the HIP report submission script.
ru: Сценарию предоставления отчёта HIP необходимо указать аргумент «--csd-wrapper».

source: Error: Running the 'HIP Report' script on this platform is not yet implemented.
ru: Ошибка: выполнение сценария «HIP Report» ещё не реализовано на данной платформе.

source: Trying to run HIP Trojan script '%s'.
ru: Попытка выполнить сценарий трояна HIP «%s».

source: Failed to create pipe for HIP script
ru: Не удалось создать конвейер для сценария HIP

source: Failed to fork for HIP script
ru: Не удалось создать форк для сценария HIP

source: HIP script '%s' exited abnormally
ru: Сценарий HIP «%s» завершился с ошибками

source: HIP script '%s' returned non-zero status: %d
ru: Сценарий HIP «%s» вернул статус, отличный от нуля: %d

source: HIP script '%s' completed successfully (report is %d bytes).
ru: Сценарий HIP «%s» выполнен успешно (размер отчёта: %d байт).

source: HIP report submission failed.
ru: Не удалось отправить отчёт HIP.

source: HIP report submitted successfully.
ru: Отчёт HIP успешно отправлен.

source: Failed to exec HIP script %s
ru: Сбой выполнения сценария HIP %s

source: Gateway says HIP report submission is needed.
ru: Шлюз сообщает, что необходимо отправить отчёт HIP.

source: Gateway says no HIP report submission is needed.
ru: Шлюз сообщает, что отправка отчёта HIP не требуется.

source: ESP tunnel connected; exiting HTTPS mainloop.
ru: Тоннель ESP подключён; выполняется выход из основного цикла HTTPS.

source: Failed to connect ESP tunnel; using HTTPS instead.
ru: Не удалось подключить тоннель ESP; используется HTTPS.

source: Packet receive error: %s
ru: Ошибка получения пакета: %s

source: Unexpected packet length. SSL_read returned %d (includes 16 header bytes) but header payload_len is %d
ru: Непредвиденная длина пакета. SSL_read вернул %d (включая 16 байт заголовка), но значение заголовка payload_len равно %d

source: Got GPST DPD/keepalive response
ru: Получен ответ GPST DPD/keepalive

source: Expected 0000000000000000 as last 8 bytes of DPD/keepalive packet header, but got:
ru: В качестве последних 8 байт заголовка пакета DPD/keepalive ожидалось 0000000000000000, но получено:

source: Received IPv%d data packet of %d bytes
ru: Получен пакет данных IPv%d размером %d байт

source: Expected 0100000000000000 as last 8 bytes of data packet header, but got:
ru: В качестве последних 8 байт заголовка пакета данных ожидалось 010000000000000, но получено:

source: Unknown packet. Header dump follows:
ru: Неизвестный пакет. Дальше следует дамп заголовка:

source: GlobalProtect HIP check due
ru: Срок проверки GlobalProtect HIP

source: HIP check or report failed
ru: Сбой проверки или отчёта HIP

source: GlobalProtect rekey due
ru: Необходима замена ключей GlobalProtect

source: GPST Dead Peer Detection detected dead peer!
ru: Обнаружение нерабочих пиров GPST: обнаружен нерабочий пир.

source: Send GPST DPD/keepalive request
ru: Послать запрос GPST DPD/keepalive

source: Sending IPv%d data packet of %d bytes
ru: Отправляется пакет данных IPv%d размером %d байт

source: ICMPv%d probe packet (seq %d) for GlobalProtect ESP:
ru: Пробный пакет ICMPv%d (последовательность %d) для GlobalProtect ESP:

source: Failed to send ESP probe
ru: Не удалось отправить пробу ESP

source: Error importing GSSAPI name for authentication:
ru: Ошибка импорта имени GSSAPI для аутентификации:

source: Error generating GSSAPI response:
ru: Ошибка создания ответа GSSAPI:

source: Attempting GSSAPI authentication to proxy
ru: Попытка аутентификации GSSAPI на прокси

source: Attempting GSSAPI authentication to server '%s'
ru: Попытка аутентификации GSSAPI на сервере '%s'

source: GSSAPI authentication completed
ru: Аутентификация GSSAPI завершена

source: GSSAPI token too large (%zd bytes)
ru: Слишком большой размер токена GSSAPI (%zd байт)

source: Sending GSSAPI token of %zu bytes
ru: Отправляется токен GSSAPI размером %zu байтов
