Repository: GNOME/NetworkManager-openconnect
Catalog: po/*.po
Languages: ru

source: WARNING: Split include "%s" has host bits set, replacing with "%s/%d".
ru: ПРЕДУПРЕЖДЕНИЕ: для включения при раздельном туннелировании "%s" настроены биты хоста, заменяем на "%s/%d".

source: WARNING: Split exclude "%s" has host bits set, replacing with "%s/%d".
ru: ПРЕДУПРЕЖДЕНИЕ: для исключения при раздельном туннелировании "%s" настроены биты хоста, заменяем на "%s/%d".

source: Ignoring legacy network because address "%s" is invalid.
ru: Сеть в устаревшем формате игнорируется, т.к. адрес "%s" не является действительным.

source: Ignoring legacy network because netmask "%s" is invalid.
ru: Сеть в устаревшем формате игнорируется, т.к. сетевая маска "%s" не является действительной.

source: Failed to get script exit status: %s
ru: Не удалось получить статус выхода сценария: %s

source: Script '%s' returned error %ld
ru: Сценарий '%s' вернул ошибку %ld

source: Script did not complete within 10 seconds.
ru: Сценарий не завершился за 10 секунд.

source: Failed to spawn script '%s' for %s: %s
ru: Не удалось создать сценарий '%s' для %s: %s

source: Script '%s' exited abnormally (%x)
ru: Сценарий '%s' завершился аварийно (%x)

source: Script '%s' returned error %d
ru: Сценарий '%s' вернул ошибку %d

source: Failed select() for socket connect
ru: Сбой select() для подключения сокета

source: Socket connect cancelled
ru: Подключение сокета отменено

source: Failed select() for socket accept
ru: Сбой select() для принятия сокета

source: Socket accept cancelled
ru: Принятие сокета отменено

source: Failed to accept local connection: %s
ru: Не удалось принять локальное подключение: %s

source: Failed setsockopt(TCP_NODELAY) on TLS socket:
ru: Сбой setsockopt(TCP_NODELAY) на сокете TLS:

source: Failed to reconnect to proxy %s: %s
ru: Не удалось установить повторное подключение к прокси %s: %s

source: Failed to reconnect to host %s: %s
ru: Не удалось установить повторное подключение к хосту %s: %s

source: Proxy from libproxy: %s://%s:%d/
ru: Прокси из libproxy: %s://%s:%d/

source: Reconnecting to DynDNS server using previously cached IP address
ru: Повторное подключение к серверу DynDNS с помощью ранее кэшированного адреса IP

source: Attempting to connect to proxy %s%s%s:%s
ru: Пытаемся подключиться к прокси %s%s%s:%s

source: Attempting to connect to server %s%s%s:%s
ru: Пытаемся подключиться к серверу %s%s%s:%s

source: Connected to %s%s%s:%s
ru: Подключено к %s%s%s:%s

source: Failed to allocate sockaddr storage
ru: Не удалось выделить память для хранилища sockaddr

source: Failed to connect to %s%s%s:%s: %s
ru: Не удалось подключиться к %s%s%s:%s: %s

source: Forgetting non-functional previous peer address
ru: Забываем нерабочий предыдущий адрес пира

source: Failed to connect to host %s
ru: Не удалось подключиться к хосту %s

source: Reconnecting to proxy %s
ru: Повторно подключаемся к прокси %s

source: Could not obtain file system ID for passphrase
ru: Не удалось получить ID файловой системы для парольной фразы

source: Failed to open private key file '%s': %s
ru: Не удалось открыть файл закрытого ключа '%s: %s

source: No error
ru: Без ошибок

source: Keystore locked
ru: Хранилище ключей заблокировано

source: Keystore uninitialized
ru: Хранилище ключей не инициализировано

source: System error
ru: Системная ошибка

source: Protocol error
ru: Ошибка протокола

source: Permission denied
ru: В разрешении отказано

source: Key not found
ru: Ключ не найден

source: Value corrupted
ru: Значение повреждено

source: Undefined action
ru: Неопределённое действие

source: Wrong password
ru: Неверный пароль

source: Unknown error
ru: Неизвестная ошибка

source: Got cancel on legacy fd
ru: Получен cancel для файлового дескриптора устаревшего формата

source: Got cancel command
ru: Получена команда cancel

source: Got pause command
ru: Получена команда pause

source: Failed select() for command socket
ru: Сбой select() для командного сокета

source: %s() used with unsupported mode '%s'
ru: %s() был использован в неподдерживаемом режиме '%s'

source: Failed to open %s: %s
ru: Не удалось открыть %s: %s

source: Failed to fstat() %s: %s
ru: Не удалось выполнить fstat() %s: %s

source: File %s is empty
ru: Пустой файл %s

source: File %s has suspicious size %<PRId64>
ru: Подозрительный размер для файла %s: %<PRId64>

source: Failed to allocate %d bytes for %s
ru: Не удалось выделить %d байтов памяти для %s

source: Failed to read %s: %s
ru: Не удалось прочитать %s: %s

source: Unknown protocol family %d. Cannot create UDP server address
ru: Неизвестное семейство протоколов %d. Невозможно создать адрес UDP сервера

source: Open UDP socket
ru: Открыт сокет UDP

source: Unknown protocol family %d. Cannot use UDP transport
ru: Неизвестное семейство протоколов %d. Невозможно использовать транспорт UDP

source: Bind UDP socket
ru: Связывание сокета UDP

source: Connect UDP socket
ru: Соединение с сокетом UDP

source: Make UDP socket non-blocking
ru: Сделать сокет UDP неблокирующим

source: Cookie is no longer valid, ending session
ru: Cookie-файлы больше не действительны, завершаем сеанс

source: sleep %ds, remaining timeout %ds
ru: sleep %ds, оставшееся время ожидания %ds

source: Failed select() for socket send
ru: Сбой select() для сокета отправки

source: Failed select() for socket recv
ru: Сбой select() для сокета получения

source: SSPI token too large (%ld bytes)
ru: Слишком большой размер токена SSPI (%ld байт)

source: Sending SSPI token of %lu bytes
ru: Отправляется токен SSPI размером %lu байт

source: Failed to send SSPI authentication token to proxy: %s
ru: Не удалось отправить токен аутентификации SSPI на прокси: %s

source: Failed to receive SSPI authentication token from proxy: %s
ru: Не удалось получить токен аутентификация SSPI от прокси: %s

source: SOCKS server reported SSPI context failure
ru: Сервер SOCKS сообщил о сбое контекста SSPI

source: Unknown SSPI status response (0x%02x) from SOCKS server
ru: Неизвестный ответ о статусе SSPI (0x%02x) от сервера SOCKS

source: Got SSPI token of %lu bytes: %02x %02x %02x %02x
ru: Получен токен SSPI размером %lu байт: %02x %02x %02x %02x

source: QueryContextAttributes() failed: %lx
ru: Сбой QueryContextAttributes(): %lx

source: EncryptMessage() failed: %lx
ru: Сбой EncryptMessage(): %lx

source: EncryptMessage() result too large (%lu + %lu + %lu)
ru: Слишком большой размер результата EncryptMessage() (%lu + %lu + %lu)

source: Sending SSPI protection negotiation of %u bytes
ru: Отправляется согласование защиты SSPI размером %u байт

source: Failed to send SSPI protection response to proxy: %s
ru: Не удалось отправить ответ защиты SSPI на прокси: %s

source: Failed to receive SSPI protection response from proxy: %s
ru: Не удалось получить ответ защиты SSPI от прокси: %s

source: Got SSPI protection response of %d bytes: %02x %02x %02x %02x
ru: Получен ответ защиты SSPI размером %d байт: %02x %02x %02x %02x

source: DecryptMessage failed: %lx
ru: Сбой DecryptMessage: %lx

source: Invalid SSPI protection response from proxy (%lu bytes)
ru: Недействительный ответ защиты SSPI от прокси (%lu байт)

source: Enter credentials to unlock software token.
ru: Введите учётные данные для разблокирования программного токена

source: Device ID:
ru: Идентификатор устройства:

source: User bypassed soft token.
ru: Программный токен обойдён пользователем

source: All fields are required; try again.
ru: Все поля являются обязательными; повторите попытку.

source: General failure in libstoken.
ru: Общий сбой libstoken

source: Incorrect device ID or password; try again.
ru: Неверный идентификатор устройства или пароль; повторите попытку

source: Soft token init was successful.
ru: Успешная инициализация программного токена

source: Enter software token PIN.
ru: Введите PIN программного токена.

source: Invalid PIN format; try again.
ru: Неверный формат PIN; повторите попытку.

source: Generating RSA token code
ru: Создаётся код токена RSA

source: Cannot allocate memory for adapter info
ru: Не удалось выделить память для adapter info

source: Ignoring non-matching interface "%S"
ru: Несоответствующий интерфейс "%S" игнорируется

source: Interface "%S" is not supported
ru: Интерфейс "%S" не поддерживается

source: Error accessing registry key for network adapters: %s (%ld)
ru: Ошибка при доступе сетевых адаптеров к ключу реестра: %s (%ld)

source: Cannot open registry key %s: %s (%ld)
ru: Невозможно открыть ключ реестра %s: %s (%ld)

source: Cannot read registry key %s\%s: value not found
ru: Невозможно прочитать ключ реестра %s\%s: значение не найдено

source: Cannot read registry key %s\%s: value is not a string (%ld)
ru: Невозможно прочитать ключ реестра %s\%s: значение не является строкой (%ld)

source: Cannot read registry key %s\%s or is not string: %s (%ld)
ru: Невозможно прочитать ключ реестра %s\%s, либо это не строка: %s (%ld)

source: %s\ComponentId is unknown '%s'
ru: %s\Неизвестный ComponentId '%s'

source: Found %s at %s
ru: Найден %s у %s

source: Cannot open registry key %s
ru: Невозможно открыть ключ реестра %s

source: Cannot read registry key %s\%s: character buffer too small: %llu chars required
ru: Невозможно прочитать ключ реестра %s\%s: слишком маленький буфер символа: требуется %llu символов

source: Cannot read registry key %s\%s: %s (%ld)
ru: Невозможно прочитать ключ реестра %s\%s: %s (%ld)

source: Access denied creating Wintun adapter. Are you running with Administrator privileges?
ru: «Доступ запрещён» при создании адаптера Wintun. Действия выполняются с привилегиями администратора?

source: GetAdapterIndex() failed: %s Falling back to GetAdaptersInfo()
ru: Сбой GetAdapterIndex(): %s Выполняем откат к GetAdaptersInfo()

source: GetAdaptersInfo() failed: %s
ru: Сбой GetAdaptersInfo(): %s

source: GetAdaptersAddresses() failed: %s
ru: Сбой GetAdaptersAddresses(): %s

source: Adapter "%S" / %ld is UP and using our IPv%d address. Cannot resolve.
ru: Адаптер "%S" / %ld ЗАПУЩЕН и использует наш адрес IPv%d. Определение имён невозможно.

source: Adapter "%S" / %ld is DOWN and using our IPv%d address. We will reclaim the address from it.
ru: Адаптер "%S" / %ld НЕ ЗАПУЩЕН и использует наш адрес IPv%d. Адрес будет востребован у адаптера.

source: GetUnicastIpAddressTable() failed: %s
ru: Сбой GetUnicastIpAddressTable(): %s

source: DeleteUnicastIpAddressEntry() failed: %s
ru: Сбой DeleteUnicastIpAddressEntry(): %s

source: GetUnicastIpAddressTable() did not find matching address to reclaim
ru: GetUnicastIpAddressTable() не нашёл совпадающего адреса для его востребования

source: Opened tun device %S
ru: Устройство tun %S открыто

source: Failed to obtain TAP driver version: %s
ru: Не удалось получить версию драйвера TAP: %s

source: Error: TAP-Windows driver v9.9 or greater is required (found %ld.%ld)
ru: Ошибка: требуется драйвер TAP-Windows версии 9.9 или более поздней (обнаружена версия %ld.%ld)

source: Failed to set TAP IP addresses: %s
ru: Не удалось настроить адреса TAP IP: %s

source: Failed to set TAP media status: %s
ru: Не удалось настроить статус носителя TAP: %s

source: Could not convert interface name to UTF-8
ru: Не удалось преобразовать имя интерфейса в формат UTF-8

source: Using %s device '%s', index %d
ru: Используется устройство %s '%s', индекс %d

source: WARNING: Support for Wintun is experimental and may be unstable. If you encounter problems, install the TAP-Windows driver instead. See %s
ru: ПРЕДУПРЕЖДЕНИЕ: поддержка Wintun является экспериментальной, возможна нестабильная работа. При возникновении проблем установите замену в виде драйвера TAP-Windows. См. %s

source: Could not construct interface name for "%s"
ru: Не удалось создать имя интерфейса для "%s"

source: Unable to find a usable default adapter name based on hostname.
ru: Невозможно найти используемое имя адаптера на основе имени хоста.

source: Neither Windows-TAP nor Wintun adapters were found. Is the driver installed?
ru: Не найдено ни адаптеров Windows-TAP, ни адаптеров Wintun. Был ли установлен драйвер?

source: TAP device aborted connectivity. Disconnecting.
ru: Устройство TAP отменило возможность подключения. Отключаемся.

source: Failed to read from TAP device: %s
ru: Не удалось прочитать из устройства TAP: %s

source: Failed to complete read from TAP device: %s
ru: Не удалось завершить чтение из устройства TAP: %s

source: Wrote %ld bytes to tun
ru: Записано %ld байт на tun

source: Waiting for tun write...
ru: Ожидаем запись на tun…

source: Wrote %ld bytes to tun after waiting
ru: После ожидания на tun было записано %ld байт

source: Failed to write to TAP device: %s
ru: Не удалось выполнить запись на устройство TAP: %s

source: Spawning tunnel scripts is not yet supported on Windows
ru: Создание тоннельных сценариев в Windows ещё не поддерживается

source: Could not open /dev/tun for plumbing
ru: Не удалось открыть /dev/tun для создания конвейера перенаправления

source: Can't push IP
ru: Невозможно отправить IP

source: Can't set ifname
ru: Невозможно указать ifname

source: Can't open %s: %s
ru: Невозможно открыть %s: %s

source: Can't plumb %s for IPv%d: %s
ru: Невозможно создать конвейер перенаправления из %s в IPv%d: %s

source: open /dev/tun
ru: открыть /dev/tun

source: Failed to create new tun
ru: Не удалось создать новый tun

source: Failed to put tun file descriptor into message-discard mode
ru: Не удалось перевести файловый дескриптор tun в режим message-discard

source: tun device is unsupported on this platform
ru: устройства tun не поддерживаются на этой платформе

source: Requested tun device name '%s' is too long
ru: Запрошено слишком длинное имя устройства '%s'

source: Failed to open tun device: %s
ru: Не удалось открыть устройство tun: %s

source: Failed to bind local tun device (TUNSETIFF): %s
ru: Не удалось связать локальное устройство tun (TUNSETIFF): %s

source: To configure local networking, openconnect must be running as root See %s for more information
ru: Для возможность настроить локальную сеть необходимо запустить openconnect с правами root Подробности см. на %s

source: Invalid interface name '%s'; must match 'utun%%d' or 'tun%%d'
ru: Недействительное имя интерфейса '%s'; имя должно совпадать с 'utun%%d' или с 'tun%%d'

source: Failed to open SYSPROTO_CONTROL socket: %s
ru: Не удалось открыть сокет SYSPROTO_CONTROL: %s

source: Failed to query utun control id: %s
ru: Не удалось опросить контрольный идентификатор utun: %s

source: Failed to allocate utun device name
ru: Не удалось выделить память для имени устройства utun

source: Failed to connect utun unit: %s
ru: Не удалось подключиться к модулю utun: %s

source: Invalid interface name '%s'; must match 'tun%%d'
ru: Недействительное имя интерфейса '%s'; имя должно совпадать с 'tun%%d'

source: Cannot open '%s': %s
ru: Невозможно открыть '%s': %s

source: Failed to make tun socket nonblocking: %s
ru: Не удалось пометить сокет tun как не подлежащий блокировке: %s

source: socketpair failed: %s
ru: сбой socketpair: %s

source: fork failed: %s
ru: сбой fork: %s

source: Failed to write incoming packet: %s
ru: Не удалось записать входящий пакет: %s

source: Failed to set vring #%d size: %s
ru: Не удалось настроить размер vring #%d: %s

source: Failed to set vring #%d base: %s
ru: Не удалось настроить основу vring #%d: %s

source: Failed to set vring #%d RX backend: %s
ru: Не удалось настроить принимающую серверную часть vring #%d: %s

source: Failed to set vring #%d call eventfd: %s
ru: Не удалось указать дескриптор события вызова vring #%d: %s

source: Failed to set vring #%d kick eventfd: %s
ru: Не удалось указать дескриптор файла события отбрасывания vring %d: %s

source: Failed to find virtual task size; search reached zero
ru: Не удалось найти размер виртуальной задачи; поиск достиг нуля

source: Detected virtual address range 0x%lx-0x%lx
ru: Обнаружен диапазон виртуальных адресов 0x%lx-0x%lx

source: Not using vhost-net due to low queue length %d
ru: Не используем vhost-net в связи с короткой длиной очереди %d

source: Failed to open /dev/vhost-net: %s
ru: Не удалось открыть /dev/vhost-net: %s

source: Failed to set vhost ownership: %s
ru: Не удалось настроить владельца vhost: %s

source: Failed to get vhost features: %s
ru: Не удалось получить сведения о функционале vhost: %s

source: vhost-net lacks required features: %llx
ru: у vhost-net отсутствует требуемый функционал: %llx

source: Failed to set vhost features: %s
ru: Не удалось настроить возможности vhost: %s

source: Failed to open vhost kick eventfd: %s
ru: Не удалось открыть дескриптор файла события отбрасывания vhost: %s

source: Failed to open vhost call eventfd: %s
ru: Не удалось открыть дескриптор файла события вызова vhost: %s

source: Failed to set vhost memory map: %s
ru: Не удалось настроить карту памяти vhost: %s

source: Failed to set tun sndbuf: %s
ru: Не удалось настроить tun sndbuf: %s

source: Using vhost-net for tun acceleration, ring size %d
ru: Для ускорения tun используется vhost-net, размер кольца %d

source: Error: vhost gave back invalid descriptor %d, len %d
ru: Ошибка: vhost вернул недействительный дескриптор %d, длина %d

source: vhost gave back empty descriptor %d
ru: vhost вернул пустой дескриптор %d

source: Free TX packet %p [%d] [used %d]
ru: Свободный пакет передачи %p [%d] [использовано %d]

source: RX packet %p(%d) [%d] [used %d]
ru: Пакет приёма %p(%d) [%d] [использовано %d]

source: Queue TX packet %p at desc %d avail %d
ru: Пакет передачи очереди %p с описанием %d, доступно %d

source: Queue RX packet %p at desc %d avail %d
ru: Пакет приёма очереди %p с описанием %d, доступно %d

source: Immediate wake because vhost ring moved on from 0x%x to 0x%x
ru: Срочное пробуждение, т.к. кольцо vhost переместилось из 0x%x в 0x%x

source: Failed to kick vhost-net eventfd
ru: Не удалось отбросить дескриптор файла события vhost-net

source: Kick vhost ring
ru: Отбрасывание кольца vhost

source: Could not load wintun.dll
ru: Не удалось загрузить wintun.dll

source: Could not resolve functions from wintun.dll
ru: Не удалось определить названия функций wintun.dll

source: Wintun adapter has not been opened
ru: Адаптер Wintun не был открыт

source: Unable to get Wintun adapter Guid
ru: Невозможно получить Guid адаптера Wintun

source: Loaded Wintun v%lu.%lu
ru: Wintun v%lu.%lu загружен

source: Failed to create Wintun session: %s
ru: Не удалось создать сеанс Wintun: %s

source: Could not retrieve packet from Wintun adapter '%S': %s
ru: Не удалось получить пакет с адаптера Wintun '%S': %s

source: Drop oversized packet retrieved from Wintun adapter '%S' (%ld > %d)
ru: Выкинуть пакет с превышенным размером с адаптера Wintun '%S' (%ld > %d)

source: Could not send packet through Wintun adapter '%S': %s
ru: Не удалось отправить пакет с использованием адаптера Wintun '%S': %s

source: Treating host "%s" as a raw hostname
ru: Имя хоста "%s" обрабатывается как имя без форматирования

source: Failed to SHA1 existing file
ru: Не удалось просчитать SHA1 для существующего файла

source: XML config file SHA1: %s
ru: Значение SHA1 для файла XML конфигурации: %s

source: Failed to parse XML config file %s
ru: Не удалось проанализировать файл XML конфигурации %s

source: Host "%s" has address "%s"
ru: Адрес хоста "%s": "%s"

source: Host "%s" has UserGroup "%s"
ru: UserGroup хоста "%s": "%s"

source: Host "%s" not listed in config; treating as raw hostname
ru: Хост "%s" отсутствует в списках конфигурации; обрабатываем как имя без форматирования

source: Failed to send "%s" to ykneo-oath applet: %s
ru: Не удалось отправить "%s" аплету ykneo-oath: %s

source: Invalid short response to "%s" from ykneo-oath applet
ru: Недействительный короткий ответ "%s" от аплета ykneo-oath

source: Failure response to "%s": %04x
ru: Ответ с сообщением о сбое для "%s": %04x

source: select applet command
ru: выберите команду аплета

source: Unrecognised response from ykneo-oath applet
ru: Нераспознанный ответ от аплета ykneo-oath

source: Found ykneo-oath applet v%d.%d.%d.
ru: Найден аплет ykneo-oath v%d.%d.%d.

source: PIN required for Yubikey OATH applet
ru: Для аплета Yubikey OATH требуется PIN

source: Failed to calculate Yubikey unlock response
ru: Не удалось рассчитать ответ для разблокирования Yubikey

source: unlock command
ru: команда разблокирования

source: Trying truncated-char PBKBF2 variant of Yubikey PIN
ru: Пробуем вариант Yubikey PIN PBKBF2 с обрезанными символами

source: Failed to establish PC/SC context: %s
ru: Не удалось создать контекст PC/SC: %s

source: Established PC/SC context
ru: Контекст PC/SC создан

source: Failed to query reader list: %s
ru: Сбой запроса списка программы чтения: %s

source: Failed to connect to PC/SC reader '%s': %s
ru: Не удалось подключиться к программе чтения PC/SC «%s»: %s

source: Connected PC/SC reader '%s'
ru: Подключено к программе чтения PC/SC «%s»

source: Failed to obtain exclusive access to reader '%s': %s
ru: Не удалось получить эксклюзивный доступ к программе чтения «%s»: %s

source: list keys command
ru: команда списка ключей

source: Found %s/%s key '%s' on '%s'
ru: Найден ключ %s/%s '%s' в '%s'

source: Token '%s' not found on Yubikey '%s'. Searching for another Yubikey...
ru: Токен '%s' не найден в Yubikey '%s'. Ищем другой Yubikey…

source: Server is rejecting the Yubikey token; switching to manual entry
ru: Сервер не принимает токен Yubikey; переключаем на ручной ввод

source: Generating Yubikey token code
ru: Создаётся код токена Yubikey

source: Failed to obtain exclusive access to Yubikey: %s
ru: Не удалось получить эксклюзивный доступ к Yubikey: %s

source: calculate command
ru: команда для вычисления

source: Unrecognised response from Yubikey when generating tokencode
ru: Нераспознанный ответ от Yubikey при создании кода токена
