Repository: GNOME/NetworkManager-openconnect
Catalog: po/*.po
Languages: ru

source: OpenConnect VPN client
ru: Клиент OpenConnect VPN

source: Client for Cisco AnyConnect SSL VPN virtual private networks
ru: Клиент частных виртуальных сетей SSL VPN Cisco AnyConnect

source: Support for configuring SSL VPN virtual private network connections using OpenConnect.
ru: Поддержка создания конфигураций виртуальных частных подключений SSL VPN с использованием OpenConnect.

source: Compatible with Cisco AnyConnect, Juniper and ocserv based networks.
ru: Совместимо с сетями на базе Cisco AnyConnect, Juniper и ocserv.

source: The NetworkManager Developers
ru: Разработчики NetworkManager

source: Connect to VPN “%s”
ru: Подключиться к VPN “%s”

source: Connect to VPN
ru: Подключиться к VPN

source: <b>The certificate may be invalid or untrusted!</b>
ru: <b>Сертификат может быть недоверенным или недействительным.</b>

source: <b>Reason:
ru: <b>Причина:

source: _Cancel
ru: _Отменить

source: I really know what I am doing
ru: Я понимаю, что делаю.

source: Connect anyway
ru: Всё равно подключиться

source: _Close
ru: _Закрыть

source: VPN host
ru: Хост VPN

source: C_onnect
ru: П_одключиться

source: Automatically start connecting next time
ru: Автоматически подключаться в следующий раз

source: Select a host to fetch the login form
ru: Выберите хост для получения регистрационной формы

source: Contacting host, please wait…
ru: Соединение с хостом, подождите…

source: _Login
ru: _Выполнить вход

source: Save passwords
ru: Сохранить пароли

source: Log
ru: Журнал

source: General
ru: Общее

source: _VPN Protocol
ru: Протокол _VPN

source: _Gateway
ru: _Шлюз

source: _User Agent:
ru: _Пользовательский агент

source: _Proxy
ru: _Прокси

source: Allow security scanner _trojan (CSD)
ru: Разрешить запуск _трояна сканера безопасности (CSD)

source: Trojan (CSD) _Wrapper Script
ru: _Сценарий-обёртка трояна (CSD)

source: Reported OS
ru: Объявляемая ОС

source: Common values: linux linux-64 win mac-intel android apple-ios
ru: Частые значения: linux linux-64 win mac-intel android apple-ios

source: Certificate Authentication
ru: Аутентификация на базе сертификатов

source: Use _FSID for key passphrase
ru: Использовать _FSID в качестве парольной фразы ключа

source: Prevent user from manually accepting invalid certificates
ru: Не позволять пользователями принимать недействительные сертификаты вручную

source: Disable UDP (DTLS and ESP)
ru: Отключить UDP (DTLS и ESP)

source: In most cases, OpenConnect can detect network conditions or server configurations that do not permit UDP-based tunnels (including DTLS and ESP) to work correctly, and fall back automatically to a TLS-based tunnel. OpenConnect prefers to use a UDP-based tunnel whenever possible, for performance reasons. You should only select this option if your connection is unreliable or non-functional without it.
ru: В большинстве случаев OpenConnect может обнаружить состояние сети или конфигурацию сервера, препятствующие корректному функционалу туннелей на базе UDP (включая DTLS и ESP), и в таких случаях автоматически откатывается к туннелям на базе TLS. По причинам производительности, OpenConnect предпочитает использование туннелей на базе UDP всегда, когда это возможно. Данный параметр нужно выбирать только, если имеющееся соединение ненадёжно или вообще не функционирует без данного параметра.

source: Software Token Authentication
ru: Аутентификация по программному токену

source: Token _Mode
ru: Режим _токена

source: Token Sec_ret
ru: Се_крет токена

source: Disabled
ru: Отключено

source: RSA SecurID — read from ~/.stokenrc
ru: RSA SecurID — прочитаны данные из ~/.stokenrc

source: RSA SecurID — manually entered
ru: RSA SecurID — ручной ввод

source: TOTP — manually entered
ru: TOTP — ручной ввод

source: HOTP — manually entered
ru: HOTP — ручной ввод

source: Yubikey OATH
ru: Ключи Yubikey по стандартам OATH

source: Multi-protocol VPN client (openconnect)
ru: Многопротокольный клиент VPN (openconnect)

source: Compatible with Cisco AnyConnect, Juniper Network Connect and Junos Pulse, and PAN GlobalProtect SSL VPNs.
ru: Совместимо с приложениями Cisco AnyConnect, Juniper Network Connect и Junos Pulse, а также с PAN GlobalProtect SSL VPN.

source: object class '%s' has no property named '%s'
ru: класс объекта «%s» не содержит свойства «%s»

source: property '%s' of object class '%s' is not writable
ru: свойство «%s» класса объекта «%s» недоступно для записи

source: construct property "%s" for object '%s' can't be set after construction
ru: свойство конструкции "%s" объекта '%s' не может быть установлено после создания конструкции

source: '%s::%s' is not a valid property name; '%s' is not a GObject subtype
ru: '%s::%s' не является действительным именем свойства; '%s' не является подтипом GObject

source: unable to set property '%s' of type '%s' from value of type '%s'
ru: невозможно настроить свойство '%s' с типом '%s' на базе значения с типом '%s'

source: value "%s" of type '%s' is invalid or out of range for property '%s' of type '%s'
ru: значение "%s" с типом '%s' для свойства '%s' с типом '%s' не является действительным, или выходит за пределы диапазона

source: unable to get editor plugin name: %s
ru: не удалось получить имя модуля редактора: %s

source: missing plugin file "%s"
ru: отсутствует файл модуля "%s"

source: cannot load editor plugin: %s
ru: невозможно загрузить модуль редактора: %s

source: cannot load factory %s from plugin: %s
ru: невозможно загрузить заводские настройки %s из модуля: %s

source: unknown error creating editor instance
ru: неизвестная ошибка при создании экземпляра редактора

source: invalid integer property “%s” or out of range [%d -> %d]
ru: целочисленный параметр “%s” недействителен, либо вне диапазона [%d -> %d]

source: invalid boolean property “%s” (not yes or no)
ru: недействительный логический параметр “%s” (значениями не являются «да» или «нет»)

source: unhandled property “%s” type %s
ru: необработанный параметр “%s” с типом %s

source: property “%s” invalid or not supported
ru: недействительный или неподдерживаемый параметр "%s"

source: No VPN configuration options.
ru: Нет параметров конфигурации для VPN

source: No VPN secrets!
ru: Секреты VPN отсутствуют

source: Could not open /dev/net/tun
ru: Не удалось открыть /dev/net/tun

source: Could not create tunnel interface named '%.*s'
ru: Не удалось создать тоннельный интерфейс с именем '%.*s'

source: Could not create tunnel interface named 'vpnX', for X in 0..255
ru: Не удалось создать тоннельный интерфейс с именем 'vpnX' для X в 0..255

source: Could not set tunnel interface owner to '%d'
ru: Не удалось указать '%d' как владельца тоннельного интерфейса

source: Could not set tunnel interface persistence
ru: Не удалось настроить сохраняемость тоннельного интерфейса

source: Could not find openconnect binary.
ru: Не удалось найти исполняемый файл openconnect.

source: No VPN gateway specified.
ru: Не указан шлюз VPN.

source: No WebVPN cookie provided.
ru: Не предоставлены cookie-файлы WebVPN.

source: Don’t quit when VPN connection terminates
ru: Не закрывать программу после прерывания подключения VPN

source: Enable verbose debug logging (may expose passwords)
ru: Включить подробное журналирование отладки (пароли могут оказаться в открытом доступе)

source: D-Bus name to use for this instance
ru: Имя D-Bus, используемое для этого экземпляра

source: nm-openconnect-service provides integrated Cisco AnyConnect SSL VPN capability to NetworkManager.
ru: nm-openconnect-service предоставляет встроенные возможности Cisco AnyConnect SSL VPN для NetworkManager.

source: No ANsession cookie found
ru: cookie-файлы ANsession не найдены

source: Invalid cookie '%s'
ru: Недействительный cookie-файл '%s'

source: Found DNS server %s
ru: Обнаружен сервер DNS %s

source: Got search domain '%s'
ru: Получен домен поиска '%s'

source: Unknown Array config element '%s'
ru: Неизвестный элемент конфигурации Array '%s'

source: Initial config: Speed tunnel %d, enc %d, DPD %d
ru: Начальная конфигурация: скорость тоннеля %d, код. %d, DPD %d

source: Short write in Array JSON negotiation
ru: Недостаточно данных при согласовании протокола Array в формате JSON

source: Failed to read Array JSON response
ru: Не удалось прочитать ответ протокола Array в формате JSON

source: Unexpected response to Array JSON request
ru: Непредвиденный ответ на запрос протокола Array в формате JSON

source: Failed to parse Array JSON response
ru: Сбой анализа ответа в формате JSON протокола Array

source: Error creating array negotiation request
ru: Ошибка создания запроса на согласование array

source: Unexpected %d result from server
ru: Неожиданный результат %d от сервера

source: Error building Array DTLS negotiation packet
ru: Ошибка сборки пакета согласования DTLS для Array

source: Short write in array negotiation
ru: Недостаточно данных при согласовании array

source: Failed to read UDP negotiation response
ru: Не удалось прочитать ответ согласования UDP

source: DTLS enabled on port %d
ru: Протокол DTLS включён на порту %d

source: Refusing non-DTLS UDP tunnel
ru: Отказ для туннелей UDP без использования DTLS

source: Failed to read ipff response
ru: Не удалось прочитать ответ ipff

source: Allocation failed
ru: Сбой выделения памяти

source: Received %d more bytes after partial %d
ru: Получено ещё %d байтов после неполных %d

source: Received partial packet, %d bytes
ru: Получен неполный пакет, байтов: %d

source: Unrecognised data packet, len %d
ru: Нераспознанный пакет данных, длина: %d

source: Received partial packet, %d of %d bytes
ru: Получен неполный пакет, %d из %d байтов

source: Receive control packet of type %x:
ru: Получение контрольного пакета с типом %x:

source: Received data packet of %d bytes
ru: Получен пакет данных, байтов: %d

source: Moved down %d bytes after previous packet
ru: %d байтов перемещены ниже предыдущего пакета

source: SSL wrote too few bytes! Asked for %d, sent %d
ru: SSL записал слишком мало байтов. Запрошено: %d, отправлено %d

source: CSTP rekey due
ru: Необходима замена ключей CSTP

source: Rehandshake failed; attempting new-tunnel
ru: Сбой повторного согласования handshake; попытка создания нового тоннеля

source: TCP Dead Peer Detection detected dead peer!
ru: Обнаружение нерабочих пиров TCP: обнаружен нерабочий пир.

source: TCP reconnect failed
ru: Сбой повторного подключения TCP

source: Send TCP DPD
ru: Отправить TCP DPD

source: Send TCP Keepalive
ru: Отправить TCP Keepalive

source: Sending DTLS off packet
ru: Отправляется пакет выключения DTLS

source: Sending uncompressed data packet of %d bytes
ru: Отправляется пакет с несжатыми данными, байт: %d

source: Attempt new DTLS connection
ru: Попытка создания нового подключения DTLS

source: Failed to receive authentication response from DTLS
ru: Не удалось получить ответ аутентификации от DTLS

source: DTLS session established
ru: Сеанс DTLS установлен

source: Received Legacy IP over DTLS; assuming established
ru: С использованием DTLS получен IP в старом формате; считаем, что сеанс установлен

source: Received IPv6 over DTLS; assuming established
ru: С использованием DTLS получен IPv6; считаем, что сеанс установлен

source: Received unknown DTLS packet
ru: Получен неизвестный пакет DTLS

source: Error creating connect request for DTLS session
ru: Ошибка создания запроса на подключение для сеанса DTLS

source: Failed to write connect request to DTLS session
ru: Не удалось записать запрос на подключение в сеанс DTLS

source: Received DTLS packet 0x%02x of %d bytes
ru: Получен пакет DTLS 0x%02x из %d байт

source: DTLS rekey due
ru: Необходима замена ключей DTLS

source: DTLS Rehandshake failed; reconnecting.
ru: Сбой повторного согласования (handshake) DTLS; выполняется повторное подключение.

source: DTLS Dead Peer Detection detected dead peer!
ru: Обнаружение нерабочих пиров DTLS: обнаружен нерабочий пир.

source: Send DTLS DPD
ru: Отправка DTLS DPD

source: Failed to send DPD request. Expect disconnect
ru: Не удалось отправить запрос DPD. Ожидайте прерывания подключения

source: Sent DTLS packet of %d bytes; DTLS send returned %d
ru: Отправлен пакет DTLS размером %d байт; DTLS send вернул %d

source: Logout failed.
ru: Сбой выхода

source: Logout successful.
ru: Выход успешно выполнен.

source: SAML authentication required; using portal-userauthcookie to continue SAML.
ru: Требуется аутентификация SAML; для продолжения SAML используется portal-userauthcookie.

source: SAML authentication required; using portal-prelogonuserauthcookie to continue SAML.
ru: Требуется аутентификация SAML; для продолжения SAML используется portal-prelogonuserauthcookie.

source: Destination form field %s was specified; assuming SAML %s authentication is complete.
ru: Было указано поле формы назначения %s; считаем, что аутентификация SAML %s выполнена.

source: SAML %s authentication is required via %s
ru: Требуется аутентификация SAML %s с помощью %s

source: When SAML authentication is complete, specify destination form field by appending field_name to login URL.
ru: По завершении аутентификации SAML указать поле формы назначения, добавив field_name в конец адреса URL для входа в систему.

source: Please enter your username and password
ru: Укажите имя пользователя и пароль

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: Challenge:
ru: Вызов (challenge):

source: GlobalProtect login returned unexpected argument value arg[%d]=%s
ru: Вход в систему GlobalProtect вернул непредвиденное значение аргумента arg[%d]=%s

source: GlobalProtect login returned %s=%s (expected %s)
ru: Вход в систему GlobalProtect вернул %s=%s (ожидалось %s)

source: GlobalProtect login returned empty or missing %s
ru: Вход в систему GlobalProtect вернул пустой или отсутствующий %s

source: GlobalProtect login returned %s=%s
ru: Вход в систему GlobalProtect вернул %s=%s

source: Please report %d unexpected values above (of which %d fatal) to <%s>
ru: Пожалуйста, сообщите о непредвиденных %d значениях выше (из которых критических %d), в <%s>

source: Please select GlobalProtect gateway.
ru: Выберите шлюз GlobalProtect.

source: GATEWAY:
ru: ШЛЮЗ:

source: Ignoring portal's HIP report interval (%d minutes), because interval is already set to %d minutes.
ru: Интервал (%d мин.) отчётов сканирования HIP портала игнорируется, т.к. для этого интервала уже было настроено значение в %d мин.

source: Portal set HIP report interval to %d minutes).
ru: Портал настроил значение интервала сканирований HIP в %d мин.).

source: Portal reports GlobalProtect version %s; we will report the same client version.
ru: Портал сообщает, что версия GlobalProtect равна %s; мы сообщим такую же версию клиента.

source: GlobalProtect portal configuration lists no gateway servers.
ru: В конфигурации GlobalProtect отсутствуют серверы шлюзов.

source: unknown
ru: неизвестно

source: %d gateway servers available:
ru: доступно серверов шлюзов: %d:

source: %s (%s) [priority %d]
ru: %s (%s) [приоритет %d]

source: %s (%s) [unprioritized]
ru: %s (%s) [без приоритета]

source: Failed to generate OTP tokencode; disabling token
ru: Не удалось создать код маркёра OTP; использование маркёра отключается

source: Server is neither a GlobalProtect portal nor a gateway.
ru: Сервер не является ни порталом GlobalProtect, ни шлюзом.

source: Ignoring unknown form submit item '%s'
ru: Неизвестный элемент отправки формы игнорируется: '%s'

source: Ignoring unknown form input type '%s'
ru: Неизвестный тип ввода формы игнорируется: '%s'

source: Discarding duplicate option '%s'
ru: Дублирующий параметр '%s' не учитывается

source: Cannot handle form method='%s', action='%s'
ru: Невозможно обработать форму method='%s', action='%s'

source: Unknown textarea field: '%s'
ru: Неизвестное поле текстовой области: '%s'

source: Failed to allocate memory for communication with TNCC
ru: Не удалось выделить память для обмена данными с TNCC

source: Failed to send command to TNCC
ru: Не удалось отправить команду клиенту TNCC

source: TNCC support not implemented yet on Windows
ru: Поддержка TNCC ещё не реализована в Windows

source: No DSPREAUTH cookie; not attempting TNCC
ru: Отсутствует cookie-файл DSPREAUTH; попыток запуска TNCC не будет

source: Trying to run TNCC/Host Checker Trojan script '%s'.
ru: Попытка запуска сценария-трояна TNCC/Host Checker '%s'.

source: Failed to exec TNCC script %s: %s
ru: Не удалось выполнить сценарий TNCC %s: %s

source: Sent start; waiting for response from TNCC
ru: Послан start; ожидаем ответа от TNCC

source: Failed to read response from TNCC
ru: Не удалось прочитать ответ от TNCC

source: Received unsuccessful %s response from TNCC
ru: Получен неуспешный ответ %s от TNCC

source: TNCC response 200 OK
ru: Ответ TNCC: 200 OK

source: Second line of TNCC response: '%s'
ru: Вторая строка ответа TNCC: '%s'

source: Got new DSPREAUTH cookie from TNCC: %s
ru: От TNCC получен новый cookie-файл DSPREAUTH: %s

source: Got reauth interval from TNCC: %d seconds
ru: От клиента TNCC получен интервал reauth: %d сек

source: Unexpected non-empty line from TNCC after DSPREAUTH cookie: '%s'
ru: Новая непредвиденная строка TNCC после cookie-файла DSPREAUTH: '%s'

source: Too many non-empty lines from TNCC after DSPREAUTH cookie
ru: Слишком много непустых строк TNCC после cookie-файла DSPREAUTH

source: Failed to parse HTML document
ru: Сбой анализа документа HTML

source: Failed to find or parse web form in login page
ru: Не удалось найти или проанализировать веб-форму на странице входа

source: Encountered form with no 'name' or 'id'
ru: Обнаружена форма без «name» или «id»

source: Form action (%s) likely indicates that TNCC/Host Checker failed.
ru: Действие формы (%s) скорее всего указывает на сбой TNCC/Host Checker.

source: Unknown form (name '%s', id '%s')
ru: Неизвестная форма (имя '%s', id '%s')

source: Dumping unknown HTML form:
ru: Сбрасываем неизвестную форму HTML:

source: Form choice has no name
ru: У выбора формы нет названия

source: name %s not input
ru: назовите %s, а не ввод

source: No input type in form
ru: В форме нет типа вводных данных

source: No input name in form
ru: В форме нет имени вводных данных

source: Unknown input type %s in form
ru: Неизвестный тип ввода %s в форме

source: Empty response from server
ru: Пустой ответ от сервера

source: Failed to parse server response
ru: Не удалось проанализировать ответ сервера

source: Response was:%s
ru: Ответ был:%s

source: Received <client-cert-request> when not expected.
ru: Получен <client-cert-request>, когда он не ожидался.

source: Received <multiple-client-cert-request> when not expected.
ru: Получен <multiple-client-cert-request>, когда он не ожидался.

source: Server reported certificate error: %s.
ru: Сервер сообщил об ошибке сертификата: %s.

source: XML response has no "auth" node
ru: В ответе XML отсутствует узел "auth"

source: Asked for password but '--no-passwd' set
ru: Был запрошен пароль, но настроен параметр «--no-passwd»

source: Client certificate missing or incorrect (Certificate Validation Failure)
ru: Сбой проверки правильности сертификата: сертификат отсутствует или некорректен.

source: Not downloading XML profile because SHA1 already matches
ru: Профиль XML не будет загружен, т.к. значение SHA1 уже совпадает

source: Failed to open HTTPS connection to %s
ru: Не удалось создать подключение HTTPS к %s

source: Failed to send GET request for new config
ru: Не удалось отправить запрос GET для новой конфигурации

source: Downloaded config file did not match intended SHA1
ru: Скаченный файл конфигурации не соответствует нужной сумме SHA1

source: Downloaded new XML profile
ru: Новый профиль XML был загружен

source: Error: Running the 'Cisco Secure Desktop' trojan on this platform is not yet implemented.
ru: Ошибка: запуск трояна 'Cisco Secure Desktop' на этой платформе ещё не реализован.

source: Failed to set gid %ld: %s
ru: Не удалось настроить gid %ld: %s

source: Failed to set groups to %ld: %s
ru: Не удалось настроить %ld для групп: %s

source: Failed to set uid %ld: %s
ru: Не удалось настроить uid %ld: %s

source: Invalid user uid=%ld: %s
ru: Недействительный uid пользователя uid=%ld: %s

source: Failed to change to CSD home directory '%s': %s
ru: Не удалось перейти в домашний каталог CSD '%s': %s

source: Error: Server asked us to run CSD hostscan. You need to provide a suitable --csd-wrapper argument.
ru: Ошибка: сервер запросил у нас запуск CSD hostscan. Необходимо указать подходящий аргумент --csd-wrapper.

source: Error: Server asked us to download and run a 'Cisco Secure Desktop' trojan. This facility is disabled by default for security reasons, so you may wish to enable it.
ru: Ошибка: сервер просит нас скачать и запустить троян 'Cisco Secure Desktop'. Из соображений безопасности эта функция была отключена, возможно, её необходимо будет включить.

source: Temporary directory '%s' is not writable: %s
ru: Временный каталог '%s' недоступен для записи: %s

source: Failed to open temporary CSD script file: %s
ru: Не удалось открыть временный файл сценария CSD: %s

source: Failed to write temporary CSD script file: %s
ru: Не удалось записать временный файл сценария CSD: %s

source: Trying to run CSD Trojan script '%s'.
ru: Попытка запуска сценария трояна CSD «%s».

source: CSD script '%s' exited abnormally
ru: Сценарий CSD «%s» завершён с ошибками

source: CSD script '%s' returned non-zero status: %d
ru: Сценарий CSD «%s» вернул ненулевой статус: %d

source: Authentication may fail. If your script is not returning zero, fix it. Future versions of openconnect will abort on this error.
ru: Аутентификация может не пройти. Если ваш сценарий не возвращает ноль, исправьте его. В будущих версиях openconnect при возникновении этой ошибки будет выполняться аварийное завершение.

source: CSD script '%s' completed successfully.
ru: Сценарий CSD «%s» успешно выполнен.

source: Warning: you are running insecure CSD code with root privileges Use command line option "--csd-user"
ru: Предупреждение: выполняется незащищённый код CSD с полномочиями root Используйте консольную опцию «--csd-user»

source: Failed to exec CSD script %s
ru: Сбой выполнения сценария CSD %s

source: Unknown response from server
ru: Неизвестный ответ от сервера

source: Server requested SSL client certificate after one was provided
ru: Сервер запросил клиентский сертификат SSL после того, как такой сертификат был предоставлен.

source: Server requested SSL client certificate; none was configured
ru: Сервер запросил клиентский сертификат SSL; такие сертификаты не были настроены

source: Multiple-certificate authentication requires a second certificate; none were configured.
ru: Для аутентификации по нескольким сертификатам требуется второй сертификат; такие сертификаты не были настроены.

source: XML POST enabled
ru: XML POST включён

source: Couldn't fetch CSD stub. Proceeding anyway with CSD wrapper script.
ru: Не удалось получить сценарий-«заглушку» CSD. Всё равно переходим к выполнению сценария-обёртки CSD.

source: Fetched CSD stub for %s platform (size is %d bytes).
ru: Получен сценарий-«заглушка» CSD для платформы %s (размер: %d байт).

source: Refreshing %s after 1 second...
ru: Обновляется %s через 1 секунду...

source: Unsupported hash algorithm '%s' requested.
ru: Был запрошен неподдерживаемый алгоритм хэширования «%s».

source: Duplicate hash algorithm '%s' requested.
ru: Был запрошен дублирующий алгоритм хэширования «%s».

source: Multiple-certificate authentication signature hash algorithm negotiation failed.
ru: Не удалось согласовать алгоритм хеширования для подписи при аутентификации по нескольким сертификатам.

source: Error exporting multiple-certificate signer's certificate chain.
ru: Ошибка при экспорте цепочки сертификации подписчика нескольких сертификатов.

source: Error encoding the challenge response.
ru: Ошибка шифрования ответа на вызов (challenge).

source: (error 0x%lx)
ru: (ошибка 0x%lx)
