Repository: GNOME/NetworkManager-openconnect
Catalog: po/*.po
Languages: ru

source: Failed to send GSSAPI authentication token to proxy: %s
ru: Не удалось отправить токен аутентификации GSSAPI на прокси: %s

source: Failed to receive GSSAPI authentication token from proxy: %s
ru: Не удалось получить токен аутентификация GSSAPI от прокси: %s

source: SOCKS server reported GSSAPI context failure
ru: Сервер SOCKS сообщил о сбое контекста GSSAPI

source: Unknown GSSAPI status response (0x%02x) from SOCKS server
ru: Неизвестный ответ о статусе GSSAPI (0x%02x) от сервера SOCKS

source: Got GSSAPI token of %zu bytes: %02x %02x %02x %02x
ru: Получен токен GSSAPI размером %zu байт: %02x %02x %02x %02x

source: Sending GSSAPI protection negotiation of %zu bytes
ru: Отправляется согласование защиты GSSAPI размером %zu байт

source: Failed to send GSSAPI protection response to proxy: %s
ru: Не удалось отправить ответ защиты GSSAPI на прокси: %s

source: Failed to receive GSSAPI protection response from proxy: %s
ru: Не удалось получить ответ защиты GSSAPI от прокси: %s

source: Got GSSAPI protection response of %zu bytes: %02x %02x %02x %02x
ru: Получен ответ защиты GSSAPI размером %zu байт: %02x %02x %02x %02x

source: Invalid GSSAPI protection response from proxy (%zu bytes)
ru: Недействительный ответ защиты GSSAPI от прокси (%zu байт)

source: SOCKS proxy demands message integrity, which is not supported
ru: Прокси SOCKS требует целостности сообщений, что не поддерживается

source: SOCKS proxy demands message confidentiality, which is not supported
ru: Прокси SOCKS требует конфиденциальности сообщений, что не поддерживается

source: SOCKS proxy demands protection unknown type 0x%02x
ru: Прокси SOCKS требует защиту неизвестного типа 0x%02x

source: Spawning external browser '%s'
ru: Запускаем внешний браузер '%s'

source: Spawn browser
ru: Запустить браузер

source: Failed to listen on local port 29786: %s
ru: Не удалось прослушать локальный порт 29786: %s

source: Failed to spawn external browser for %s
ru: Не удалось запустить внешний браузер для %s

source: Accepted incoming external-browser connection on port 29786
ru: Принято входящее подключение от внешнего браузера на порту 29786

source: Invalid incoming external-browser request
ru: Недействительный входящий запрос внешнего браузера

source: Got encrypted SSO token of %d bytes
ru: Получен зашифрованный токен единого входа, размер: %d байт

source: Failed to decode SSO token at %d:
ru: Не удалось расшифровать токен единого входа в %d:

source: SSO token not alphanumeric
ru: Токен единого входа не в буквенно-числовом формате

source: Attempting HTTP Basic authentication to proxy
ru: Попытка выполнить аутентификацию HTTP Basic на прокси

source: Attempting HTTP Basic authentication to server '%s'
ru: Попытка выполнить аутентификацию HTTP Basic на сервере '%s'

source: Attempting HTTP Bearer authentication to server '%s'
ru: Попытка выполнить аутентификацию HTTP Bearer на сервере '%s'

source: This version of OpenConnect was built without GSSAPI support
ru: Данная версия OpenConnect была собрана без поддержки GSSAPI

source: Proxy requested Basic authentication which is disabled by default
ru: Прокси запросил базовую аутентификацию, которая по умолчанию отключена

source: Server '%s' requested Basic authentication which is disabled by default
ru: Сервер '%s' запросил базовую аутентификацию, которая по умолчанию отключена

source: No more authentication methods to try
ru: Методы аутентификации исчерпаны

source: No memory for allocating cookies
ru: Нет памяти для размещения cookie-файлов

source: Error reading HTTP response: %s
ru: Ошибка чтения ответа HTTP: %s

source: Failed to parse HTTP response '%s'
ru: Не удалось проанализировать ответ HTTP '%s'

source: Got HTTP response: %s
ru: Получен ответ HTTP: %s

source: Ignoring unknown HTTP response line '%s'
ru: Неизвестная строка в ответе HTTP «%s» игнорируется

source: Invalid cookie offered: %s
ru: Предложен недействительный cookie-файл: %s

source: SSL certificate authentication failed
ru: Сбой аутентификации по сертификату SSL

source: Response body has negative size (%d)
ru: У тела ответа отрицательный размер (%d)

source: Unknown Transfer-Encoding: %s
ru: Неизвестный Transfer-Encoding: %s

source: HTTP body %s (%d)
ru: Тело HTTP %s (%d)

source: Error reading HTTP response body
ru: Ошибка чтения тела ответа HTTP

source: Error fetching chunk header
ru: Ошибка при получении заголовка фрагмента

source: Error in chunked decoding. Expected hexadecimal chunk length, got: '%s'
ru: Ошибка при расшифровке фрагментов. Ожидалась шестнадцатеричная длина фрагмента, получено: '%s'

source: HTTP chunk length is negative (%ld)
ru: Отрицательная длина фрагмента HTTP (%ld)

source: HTTP chunk length is too large (%ld)
ru: Слишком длинный фрагмент HTTP (%ld)

source: Error fetching HTTP response body
ru: Ошибка получения тела ответа HTTP

source: Error in chunked decoding. Expected '', got: '%s'
ru: Ошибка при расшифровке фрагментов. Ожидалось '', получено: '%s'

source: Cannot receive HTTP 1.0 body without closing connection
ru: Невозможно получить тело HTTP 1.0 без прерывания соединения

source: Failed to parse redirected URL '%s': %s
ru: Не удалось проанализировать перенаправленный URL '%s': %s

source: Cannot follow redirection to non-https URL '%s'
ru: Перенаправление на URL '%s', не являющимся https, невозможно.

source: Allocating new path for relative redirect failed: %s
ru: Не удалось выделить новый путь для относительного перенаправления: %s

source: HTTPS socket closed by peer; reopening
ru: Пир закрыл сокет HTTPS; открываем повторно

source: Retrying failed %s request on new connection
ru: Повторно пытаемся отправить невыполненный ранее запрос %s на новое подключение

source: Unexpected empty response body from server
ru: Непредвиденное пустое тело ответа от сервера

source: request granted
ru: запрос одобрен

source: general failure
ru: общий сбой

source: connection not allowed by ruleset
ru: набор правил запрещает подключение

source: network unreachable
ru: сеть недоступна

source: host unreachable
ru: хост недоступен

source: connection refused by destination host
ru: целевой хост отказал в подключении

source: TTL expired
ru: Срок жизни истёк

source: command not supported / protocol error
ru: команда не поддерживается / ошибка протокола

source: address type not supported
ru: тип адреса не поддерживается

source: SOCKS server requested username/password but we have none
ru: Сервер SOCKS запросил имя пользователя/пароль, но у нас их нет

source: Username and password for SOCKS authentication must be < 255 bytes
ru: Имя пользователя и пароль для аутентификации SOCKS должны быть < 255 байт

source: Error writing auth request to SOCKS proxy: %s
ru: Ошибка записи запроса на аутентификацию на прокси SOCKS: %s

source: Error reading auth response from SOCKS proxy: %s
ru: Ошибка чтения ответа аутентификации от прокси SOCKS: %s

source: Unexpected auth response from SOCKS proxy: %02x %02x
ru: Непредвиденный ответ аутентификации от прокси SOCKS: %02x %02x

source: Authenticated to SOCKS server using password
ru: Выполнена аутентификация на сервере SOCKS с помощью пароля

source: Password authentication to SOCKS server failed
ru: Не удалось пройти аутентификацию на сервере SOCKS

source: SOCKS server requested GSSAPI authentication
ru: Сервер SOCKS запросил аутентификацию GSSAPI

source: SOCKS server requested password authentication
ru: Сервер SOCKS запросил аутентификацию по паролю

source: SOCKS server requires authentication
ru: Для сервера SOCKS требуется аутентификация

source: SOCKS server requested unknown authentication type %02x
ru: Сервер SOCKS запросил аутентификацию неизвестного типа %02x

source: Requesting SOCKS proxy connection to %s:%d
ru: Отправляем запрос на подключение к прокси-серверу SOCKS на %s:%d

source: Error writing connect request to SOCKS proxy: %s
ru: Ошибка записи запроса на подключение к прокси SOCKS: %s

source: Error reading connect response from SOCKS proxy: %s
ru: Ошибка чтения ответа на подключение от прокси SOCKS: %s

source: Unexpected connect response from SOCKS proxy: %02x %02x...
ru: Непредвиденный ответ на подключение от прокси SOCKS: %02x %02x...

source: SOCKS proxy error %02x: %s
ru: Ошибка прокси SOCKS %02x: %s

source: SOCKS proxy error %02x
ru: Ошибка прокси SOCKS %02x

source: Unexpected address type %02x in SOCKS connect response
ru: Непредвиденный тип адреса %02x в ответе на подключение SOCKS

source: Requesting HTTP proxy connection to %s:%d
ru: Отправляем запрос на подключение к прокси HTTP на %s:%d

source: Sending proxy request failed: %s
ru: Сбой отправки запроса на прокси: %s

source: Proxy CONNECT request failed: %d
ru: Сбой запроса CONNECT: %d

source: Unknown proxy type '%s'
ru: Неизвестный тип прокси '%s'

source: Failed to parse proxy '%s'
ru: Не удалось проанализировать прокси '%s'

source: Only http or socks(5) proxies supported
ru: Поддерживаются только прокси http или socks(5)

source: Cisco AnyConnect or OpenConnect
ru: Cisco AnyConnect или OpenConnect

source: Compatible with Cisco AnyConnect SSL VPN, as well as ocserv
ru: Совместимо с Cisco AnyConnect SSL VPN, а также с ocserv

source: Compatible with Juniper Network Connect
ru: Совместимо с Juniper Network Connect

source: Compatible with Palo Alto Networks (PAN) GlobalProtect SSL VPN
ru: Совместимо с Palo Alto Networks (PAN) GlobalProtect SSL VPN

source: Compatible with Pulse Connect Secure SSL VPN
ru: Совместимо с Pulse Connect Secure SSL VPN

source: Compatible with F5 BIG-IP SSL VPN
ru: Совместимо с F5 BIG-IP SSL VPN

source: Compatible with FortiGate SSL VPN
ru: Совместимо с FortiGate SSL VPN

source: PPP over TLS
ru: PPP поверх TLS

source: Unauthenticated RFC1661/RFC1662 PPP over TLS, for testing
ru: RFC1661/RFC1662 PPP поверх TLS, без аутентификации, для тестирования

source: Compatible with Array Networks SSL VPN
ru: Совместимо с Array Networks SSL VPN

source: Unknown VPN protocol '%s'
ru: Неизвестный протокол VPN «%s»

source: Built against SSL library with no Cisco DTLS support
ru: Собрано для библиотеки SSL без поддержки Cisco DTLS

source: No IP address received with Juniper rekey/reconnection.
ru: Не было получено адресов IP при повторной отправке ключей/повторном подключении Juniper.

source: No IP address received. Aborting
ru: Адрес IP не был получен. Прерываем операцию.

source: Reconnect gave different Legacy IP address (%s != %s)
ru: Повторное подключение выдало другой адрес IP в старом формате (%s != %s)

source: Reconnect gave different Legacy IP netmask (%s != %s)
ru: Повторное подключение выдало другую маску сети для IP старого формата (%s != %s)

source: Reconnect gave different IPv6 address (%s != %s)
ru: Повторное подключение выдало другой адрес IPv6 (%s != %s)

source: Reconnect gave different IPv6 netmask (%s != %s)
ru: Повторное подключение выдало другую маску сети IPv6 (%s != %s)

source: IPv6 configuration received but MTU %d is too small.
ru: Конфигурация IPv6 получена, но размер MTU %d слишком маленький.

source: Failed to parse server URL '%s'
ru: Не удалось проанализировать URL сервера '%s'

source: Only https:// permitted for server URL
ru: Для URL сервера разрешаются только https://

source: Unknown certificate hash: %s.
ru: Неизвестный хэш сертификата: %s.

source: The size of the provided fingerprint is less than the minimum required (%u).
ru: Размер предоставленного отпечатка меньше минимального требуемого размера (%u).

source: No form handler; cannot authenticate.
ru: Нет обработчика формы; аутентификация невозможна.

source: No form ID. This is a bug in OpenConnect's authentication code.
ru: Нет ID формы. Это баг кода аутентификации OpenConnect.

source: No SSO handler
ru: Нет обработчиков единого входа

source: CommandLineToArgv() failed: %s
ru: Сбой CommandLineToArgv(): %s

source: Fatal error in command line handling
ru: Критическая ошибка в обработке командной строки

source: ReadConsole() failed: %s
ru: Сбой ReadConsole(): %s

source: Operation aborted by user
ru: Операция прервана пользователем

source: ReadConsole() didn't read any input
ru: ReadConsole() не прочитал никаких вводных данных

source: Error converting console input: %s
ru: Ошибка преобразования вводных данных с консоли: %s

source: Allocation failure for string from stdin
ru: Не удалось разместить в памяти строку из stdin

source: For assistance with OpenConnect, please see the web page at %s
ru: Для получения помощи в работе с OpenConnect перейдите на веб-страницу по адресу %s

source: Using %s. Features present:
ru: Используется %s. Функционал в наличии:

source: OpenSSL ENGINE not present
ru: OpenSSL ENGINE отсутствует

source: WARNING: This binary lacks DTLS and/or ESP support. Performance will be impaired.
ru: ПРЕДУПРЕЖДЕНИЕ: для данного бинарного файла отсутствует поддержка DTLS и/или ESP. Производительность будет снижена.

source: Supported protocols:
ru: Поддерживаемые протоколы:

source: (default)
ru: (по умолчанию)

source: Set VPN protocol
ru: Настроить протокол VPN

source: Allocation failure for string from stdin
ru: Не удалось разместить в памяти строку из stdin

source: WARNING: Cannot set handler for signal %d: %s
ru: ПРЕДУПРЕЖДЕНИЕ: невозможно настроить обработчик для сигнала %d: %s

source: Cannot process this executable path "%s"
ru: Невозможно обработать путь до исполняемого файла "%s"

source: Allocation for vpnc-script path failed
ru: Не удалось выделить память для пути до vpnc-script

source: Default vpnc-script (override with --script):
ru: vpnc-script по умолчанию (чтобы переопределить, используйте --script):

source: Override hostname '%s' to '%s'
ru: Переопределение имени хоста с '%s' в '%s'

source: getaddrinfo failed for host '%s': %s
ru: Сбой getaddrinfo для хоста '%s': %s

source: Usage: openconnect [options] <server>
ru: Использование: openconnect [options] <сервер>

source: Open client for multiple VPN protocols, version %s
ru: Открытый клиент для различных протоколов VPN, версия %s

source: Read options from config file
ru: Читать параметры из файла конфигурации

source: Report version number
ru: Сообщить номер версии

source: Display help text
ru: Показать текст справки

source: Authentication
ru: Аутентификация

source: Set login username
ru: Настроить имя пользователя для входа

source: Disable password/SecurID authentication
ru: Отключить аутентификацию по паролю/SecurID

source: Do not expect user input; exit if it is required
ru: Не ожидать ввода данных со стороны пользователя; выйти, если он требуется

source: Read password from standard input
ru: Читать пароли со стандартного ввода

source: Select GROUP from authentication dropdown (may be known
ru: Выбрать GROUP из выпадающего меню аутентификации (может быть известна

source: as "realm", "domain", "gateway"; protocol-dependent)
ru: как "realm", "domain", "gateway"; зависит от протокола)

source: Provide authentication form responses
ru: Предоставить ответы форм аутентификации

source: Use SSL client certificate CERT
ru: Использовать клиентский сертификат SSL CERT

source: Use SSL private key file KEY
ru: Использовать файл закрытого ключа SSL KEY

source: Warn when certificate lifetime < DAYS
ru: Предупреждать, когда срок действия сертификата < ДНЕЙ

source: Set path of initial request URL
ru: Настроить путь для URL начального запроса

source: Set key passphrase or TPM SRK PIN
ru: Настроить парольную фразу или TPM SRK PIN

source: Set external browser executable
ru: Указать исполняемый файл внешнего браузера

source: Key passphrase is fsid of file system
ru: Парольная фраза ключа — идентификатор ФС (fsid)

source: Software token type: rsa, totp, hotp or oidc
ru: Тип программного токена: rsa, totp, hotp или oidc

source: Software token secret or oidc token
ru: Секрет программного токена или токен oidc

source: (NOTE: libstoken (RSA SecurID) disabled in this build)
ru: (ВНИМАНИЕ: в данной сборке libstoken (RSA SecurID) отключён)

source: (NOTE: Yubikey OATH disabled in this build)
ru: (ВНИМАНИЕ: в данной сборке Yubikey OATH отключён)

source: Server validation
ru: Проверка сервера

source: Accept only server certificate with this fingerprint
ru: Принимать сертификаты сервера только с этим отпечатком

source: Disable default system certificate authorities
ru: Отключить системные центры сертификации по умолчанию

source: Cert file for server verification
ru: Файл сертификата для проверки сервера

source: Internet connectivity
ru: Возможность подключения к Интернету

source: Set VPN server
ru: Настроить сервер VPN

source: Set proxy server
ru: Настроить прокси-сервер

source: Set proxy authentication methods
ru: Настроить методы аутентификации на прокси

source: Disable proxy
ru: Отключить использование прокси

source: Use libproxy to automatically configure proxy
ru: Использовать libproxy для автоматической настройки прокси

source: (NOTE: libproxy disabled in this build)
ru: (ВНИМАНИЕ: libproxy отключена в данной сборке)

source: Reconnection retry timeout (default is 300 seconds)
ru: Истекло время ожидания повторного подключения (по умолчанию: 300 сек)

source: Use IP when connecting to HOST
ru: Использовать IP при подключении к HOST

source: Always send HOST as TLS client SNI (domain fronting)
ru: Всегда отправлять HOST в качестве SNI клиента TLS (фронтальная обработка домена)

source: Copy TOS / TCLASS field into DTLS and ESP packets
ru: Копировать поле TOS / TCLASS в пакеты DTLS и ESP

source: Set local port for DTLS and ESP datagrams
ru: Настроить локальные порты для датаграмм DTLS и ESP

source: Authentication (two-phase)
ru: Аутентификация (двухфазная)

source: Use authentication cookie COOKIE
ru: Использовать cookie-файл COOKIE для аутентификации

source: Read cookie from standard input
ru: Читать cookie-файлы из стандартного ввода

source: Authenticate only and print login info
ru: Только выполнить аутентификацию и вывести сведения о входе

source: Fetch and print cookie only; don't connect
ru: Только получить и показать cookie-файлы; не подключаться

source: Print cookie before connecting
ru: Показать cookie-файлы перед подключением

source: Process control
ru: Управление процессом

source: Continue in background after startup
ru: После запуска продолжить в фоновом режиме

source: Write the daemon's PID to this file
ru: Записать PID демона в этот файл

source: Drop privileges after connecting
ru: Сбросить привилегии после подключения

source: Logging (two-phase)
ru: Журналирование (двухфазное)

source: Use syslog for progress messages
ru: Использовать syslog для сообщений о ходе выполнения

source: More output
ru: Более подробный вывод

source: Less output
ru: Менее подробный вывод

source: Dump HTTP authentication traffic (implies --verbose)
ru: Выводить трафик аутентификации HTTP (подразумевается --verbose)

source: Prepend timestamp to progress messages
ru: Помещать временну́ю метку в начале сообщений о ходе выполнения

source: VPN configuration script
ru: Сценарий создания конфигурации VPN

source: Use IFNAME for tunnel interface
ru: Использовать IFNAME для интерфейса тоннеля

source: Shell command line for using a vpnc-compatible config script
ru: Командная строка интерпретатора для сценария создания конфигурации, совместимого с vpnc

source: default
ru: по умолчанию

source: Pass traffic to 'script' program, not tun
ru: Передавать трафик программе 'script', а не tun

source: Tunnel control
ru: Управление тоннелем

source: Do not ask for IPv6 connectivity
ru: Не спрашивать о возможности подключения для IPv6

source: XML config file
ru: Файл конфигурации XML

source: Request MTU from server (legacy servers only)
ru: Запрашивать MTU у сервера (только для серверов в старом формате)

source: Indicate path MTU to/from server
ru: Указывать MTU пути от/до сервера

source: Enable stateful compression (default is stateless only)
ru: Включить сжатие с фиксацией состояния (по умолчанию: только без фиксации)

source: Disable all compression
ru: Отключить всё сжатие

source: Set Dead Peer Detection interval (in seconds)
ru: Настроить интервал обнаружения нерабочих пиров (сек.)

source: Require perfect forward secrecy
ru: Требовать полной безопасности пересылки (PFS)

source: Disable DTLS and ESP
ru: Отключить DTLS и ESP

source: OpenSSL ciphers to support for DTLS
ru: Поддерживаемые шифры OpenSSL для DTLS

source: Set packet queue limit to LEN pkts
ru: Установить ограничение очереди пакетов на значение LEN пакетов

source: Local system information
ru: Сведения о локальной системе

source: HTTP header User-Agent: field
ru: Поле «User-Agent:» заголовка HTTP

source: Local hostname to advertise to server
ru: Локальное имя хоста, объявляемое серверу

source: OS type to report. Allowed values are the following:
ru: Объявляемый тип ОС. Допускаются следующие значения:

source: reported version string during authentication
ru: Строка версии, объявляемая во время аутентификации

source: default:
ru: по умолчанию:

source: Trojan binary (CSD) execution
ru: Выполнение бинарного файла трояна (CSD)

source: Drop privileges during trojan execution
ru: Сбросить привилегии во время выполнения трояна

source: Run SCRIPT instead of trojan binary
ru: Запустить SCRIPT вместо бинарного файла трояна

source: Set minimum interval between trojan runs (in seconds)
ru: Настроить минимальный интервал между запусками трояна (сек.)

source: Server bugs
ru: Баги сервера

source: Do not offer or use auth methods requiring external browser
ru: Не предлагать/не использовать методы аутентификации, требующие внешнего браузера

source: Disable HTTP connection reuse
ru: Отключить повторное использование HTTP-подключений

source: Do not attempt XML POST authentication
ru: Не пытаться выполнить аутентификацию XML POST

source: Allow use of the ancient, insecure 3DES and RC4 ciphers
ru: Разрешить использование устаревших и незащищённых шифров 3DES и RC4

source: Multiple certificate authentication (MCA)
ru: Аутентификация на базе нескольких сертификатов (MCA)

source: Use MCA certificate MCACERT
ru: Использовать сертификат MCA MCACERT

source: Use MCA key MCAKEY
ru: Использовать ключ MCA MCAKEY

source: Passphrase MCAPASS for MCACERT/MCAKEY
ru: Парольная фраза MCAPASS для MCACERT/MCAKEY

source: Failed to allocate string
ru: Не удалось выделить память для строки

source: Failed to get line from config file: %s
ru: Не удалось получить строку из файла конфигурации: %s

source: Unrecognised option at line %d: '%s'
ru: Нераспознанный параметр в строке %d: '%s'

source: Option '%s' does not take an argument at line %d
ru: Параметр '%s' не принимает аргумент в строке %d

source: Option '%s' requires an argument at line %d
ru: Для параметра '%s' требуется аргумент в строке %d

source: Internal error; option '%s' unexpectedly yielded null config_arg
ru: Внутренняя ошибка; параметр '%s' неожиданно выдал нулевое значение config_arg

source: Invalid user "%s": %s
ru: Недействительный пользователь "%s": %s

source: Invalid user ID "%d": %s
ru: Недействительный ID пользователя "%d": %s

source: Unhandled autocomplete for option %d '--%s'. Please report.
ru: Необработанное автозаполнение для параметра %d '--%s'. Пожалуйста, сообщите об этом.

source: connected
ru: подключено

source: disconnected
ru: отключено

source: unsuccessful
ru: неудачно

source: in progress
ru: идёт выполнение

source: disabled
ru: отключено

source: established
ru: установлено

source: Configured as %s%s%s, with SSL%s%s %s and %s%s%s %s
ru: Настроено как %s%s%s, с SSL%s%s %s и %s%s%s %s

source: Session authentication will expire at %s
ru: Срок действия аутентификации сеанса завершится в %s

source: RX: %<PRIu64> packets (%<PRIu64> B); TX: %<PRIu64> packets (%<PRIu64> B)
ru: RX: %<PRIu64> пакетов (%<PRIu64> Байт); TX: %<PRIu64> пакетов (%<PRIu64> Байт)

source: SSL ciphersuite: %s
ru: Набор шифров SSL: %s

source: %s ciphersuite: %s
ru: Набор шифров %s: %s

source: Next SSL rekey in %ld seconds
ru: Следующая замена ключей SSL через %ld сек.
