Repository: GNOME/NetworkManager-openconnect
Catalog: po/*.po
Languages: ru

source: Next %s rekey in %ld seconds
ru: Следующая замена ключей %s через %ld сек.

source: Next Trojan invocation in %ld seconds
ru: Следующий вызов трояна через %ld сек.

source: Failed to open '%s' for write: %s
ru: Не удалось открыть '%s' для записи: %s

source: Failed to continue in background
ru: Не удалось продолжить в фоновом режиме

source: Continuing in background; pid %d
ru: Работа продолжается в фоновом режиме; pid %d

source: WARNING: Cannot set locale: %s
ru: ПРЕДУПРЕЖДЕНИЕ: невозможно указать локаль: %s

source: WARNING: This version of OpenConnect was built without iconv support but you appear to be using the legacy character set "%s". Expect strangeness.
ru: ПРЕДУПРЕЖДЕНИЕ: данная версия OpenConnect была собрана без поддержки iconv, но похоже, что тут используется устаревший набор символов "%s". Ожидайте необычных эффектов.

source: WARNING: This version of OpenConnect is %s but the libopenconnect library is %s
ru: ПРЕДУПРЕЖДЕНИЕ: версия OpenConnect: %s, но версия библиотеки libopenconnect: %s

source: WARNING: This build is intended only for debugging purposes and may allow you to establish insecure connections.
ru: ПРЕДУПРЕЖДЕНИЕ: данная сборка предназначена только для задач отладки, возможно, будет возможно создавать незащищённые подключения.

source: Failed to allocate vpninfo structure
ru: Не удалось выделить память для структуры vpninfo

source: WARNING: --juniper is deprecated, use --protocol=nc instead.
ru: ПРЕДУПРЕЖДЕНИЕ: аргумент «--juniper» устарел, используйте вместо него «--protocol=nc».

source: Cannot use 'config' option inside config file
ru: Параметр 'config' невозможно использовать внутри файла конфигурации

source: Cannot open config file '%s': %s
ru: Невозможно открыть файл конфигурации '%s': %s

source: Invalid compression mode '%s'
ru: Недействительный режим сжатия '%s'

source: Cannot enable insecure 3DES or RC4 ciphers, because the library %s no longer supports them.
ru: Невозможно включить использование ненадёжных шифров 3DES или RC4, т.к. библиотека %s больше их не поддерживает.

source: Failed to allocate memory
ru: Не удалось выделить память

source: Missing colon in resolve option
ru: В параметре определения названий отсутствует двоеточие

source: WARNING: You are running on macOS and specified --interface='%s' This probably won't work since recent macOS versions use utun instead. Perhaps try --interface='u%s', or omit altogether.
ru: ПРЕДУПРЕЖДЕНИЕ: вы работаете в macOS и указали --interface='%s' Этот параметре скорее всего ни на что не повлияет, т.к. в последних версиях macOS используется utun. Попробуйте «--interface='u%s'», или вообще не используйте этот параметр.

source: MTU %d too small
ru: Слишком маленькое значение MTU: %d

source: Disabling all HTTP connection reuse due to --no-http-keepalive option. If this helps, please report to <%s>.
ru: Повторное использование всех подключений HTTP отключается в связи с параметром «--no-http-keepalive». Если это поможет, сообщите об этом на <%s>.

source: The --no-cert-check option was insecure and has been removed. Fix your server's certificate or use --servercert to trust it.
ru: Параметр «--no-cert-check» являлся ненадёжным и был удалён. Скорректируйте сертификат вашего сервера, либо используйте «--servercert» для доверия к нему.

source: Queue length zero not permitted; using 1
ru: Нулевая длина очереди не разрешается, используем 1

source: OpenConnect version %s
ru: Версия OpenConnect %s

source: Invalid software token mode "%s"
ru: Недействительный режим программного токена "%s"

source: Invalid OS identity "%s" Allowed values: linux, linux-64, win, mac-intel, android, apple-ios
ru: Недопустимый идентификатор ОС: "%s" Допустимые значения: linux, linux-64, win, mac-intel, android, apple-ios

source: WARNING: You specified %s. This should not be necessary; please report cases where a priority string override is necessary to connect to a server to <%s>.
ru: ПРЕДУПРЕЖДЕНИЕ: вы указали %s. В этом не должно возникать необходимости; о случаях, когда для подключения к серверу требуется переопределение строки приоритете, пожалуйте, сообщайте на <%s>.

source: No server specified
ru: Сервер не указан

source: Too many arguments on command line
ru: Слишком много аргументов командной строки

source: This version of OpenConnect was built without libproxy support
ru: Данная версия OpenConnect была собрана без поддержки libproxy

source: Error opening cmd pipe: %s
ru: Ошибка открытия конвейера команд: %s

source: Failed to complete authentication
ru: Не удалось завершить аутентификацию

source: Creating SSL connection failed
ru: Не удалось создать подключение SSL

source: Set up UDP failed; using SSL instead
ru: Не удалось настроить UDP; используем вместо него SSL

source: No --script argument provided; DNS and routing are not configured
ru: Аргумент «--script» не был предоставлен; DNS и маршрутизация не настроены

source: See %s
ru: См. %s

source: User requested reconnect
ru: Пользователь запросил повторное подключение

source: Cookie was rejected by server; exiting.
ru: Cookie-файлы не были приняты сервером; завершаем работу

source: Session terminated by server; exiting.
ru: Сеанс завершён сервером; вынужденный выход

source: User cancelled (%s); exiting.
ru: Пользователь отменил (%s); вынужденный выход.

source: User detached from session (%s); exiting.
ru: Пользователь отключился от сеанса (%s); завершаем работу.

source: Unrecoverable I/O error; exiting.
ru: Непоправимая ошибка ввода-вывода; вынужденный выход.

source: Unknown error; exiting.
ru: Неизвестная ошибка; вынужденный выход

source: Failed to open %s for write: %s
ru: Не удалось открыть %s для записи: %s

source: Failed to write config to %s: %s
ru: Не удалось записать конфигурацию в %s: %s

source: Insecurely accepting certificate from VPN server "%s" because you ran with --servercert=ACCEPT.
ru: Принимаем недостаточно защищённый сертификат от сервера VPN "%s", т.к. запуск был выполнен с аргументом «--servercert=ACCEPT».

source: Could not check server's certificate against %s
ru: Не удалось сравнить сертификат сервера с %s

source: None of the %d fingerprint(s) specified via --servercert match server's certificate: %s
ru: Ни один из отпечатков %d, указанных с помощью «--servercert», не совпадает с сертификатом сервера: %s

source: Certificate from VPN server "%s" failed verification. Reason: %s
ru: Сертификат сервера VPN "%s" не прошёл проверку. Причина: %s

source: To trust this server in future, perhaps add this to your command line:
ru: Чтобы в дальнейшем доверять этому серверу, добавьте в командную строку:

source: Enter '%s' to accept, '%s' to abort; anything else to view:
ru: Введите '%s' чтобы принять, '%s' для отмены операции; что-то другое для просмотра:

source: Server key hash: %s
ru: Хэш ключа сервера: %s

source: Auth choice "%s" matches multiple options
ru: Выбор аутентификации "%s" соответствует нескольким возможностям

source: Auth choice "%s" not available
ru: Выбор аутентификации "%s" недоступен

source: User input required in non-interactive mode
ru: В не интерактивном режиме требуется ввод данных пользователем.

source: Failed to open token file for write: %s
ru: Не удалось открыть файл токена для записи: %s

source: Failed to write token: %s
ru: Не удалось записать токен: %s

source: Soft token string is invalid
ru: Строка программного ключа недействительна

source: Can't open stoken file
ru: Невозможно открыть файл stoken

source: Can't open ~/.stokenrc file
ru: Невозможно открыть файл ~/.stokenrc

source: OpenConnect was not built with libstoken support
ru: OpenConnect не был собран с поддержкой libstoken

source: General failure in libstoken
ru: Общий сбой libstoken

source: General failure in TOTP/HOTP support
ru: Общий сбой поддержки TOTP/HOTP

source: Yubikey token not found
ru: Токен Yubikey не найден

source: OpenConnect was not built with Yubikey support
ru: OpenConnect не был собран с поддержкой Yubikey

source: General Yubikey failure: %s
ru: Общий сбой Yubikey: %s

source: Can't open oidc file
ru: Невозможно открыть файл oidc

source: General failure in oidc token
ru: Общий сбой токена oidc

source: Set up tun script failed
ru: Не удалось настроить сценарий tun

source: Set up tun device failed
ru: Не удалось настроить устройство tun

source: Delaying tunnel with reason: %s
ru: Задержка тоннеля по причине: %s

source: Delaying cancel (immediate callback).
ru: Задержка отмены (немедленный обратный вызов)

source: Delaying cancel.
ru: Задержка отмены

source: Delaying pause (immediate callback).
ru: Задержка паузы (немедленный обратный вызов)

source: Delaying pause.
ru: Задержка паузы.

source: Caller paused the connection
ru: Вызывающая сторона приостановила подключение

source: No work to do; sleeping for %d ms...
ru: Задач нет; спящий режим в течение %d мс…

source: WaitForMultipleObjects failed: %s
ru: Сбой WaitForMultipleObjects: %s

source: Failed epoll_wait() in mainloop
ru: Сбой epoll_wait() в основном цикле программы

source: Failed select() in mainloop
ru: Сбой select() в основном цикле программы

source: Using base_mtu of %d
ru: Используется base_mtu из %d

source: After removing %s/IPv%d headers, MTU of %d
ru: После удаления заголовков %s/IPv%d, MTU %d

source: After removing protocol specific overhead (%d unpadded, %d padded, %d blocksize), MTU of %d
ru: После удаления временных затрат протокола (без холостого заполнения: %d, с холостым заполнением: %d, размер блока: %d) MTU равен %d

source: InitializeSecurityContext() failed: %lx
ru: Сбой InitializeSecurityContext(): %lx

source: AcquireCredentialsHandle() failed: %lx
ru: Сбой AcquireCredentialsHandle(): %lx

source: Error communicating with ntlm_auth helper
ru: Ошибка обмена информацией с ntlm_auth helper

source: Attempting HTTP NTLM authentication to proxy (single-sign-on)
ru: Попытка выполнить аутентификацию HTTP NTLM на прокси (единый вход)

source: Attempting HTTP NTLM authentication to server '%s' (single-sign-on)
ru: Попытка выполнить аутентификацию NTLM по HTTP на сервере '%s' (единый вход)

source: Attempting HTTP NTLMv%d authentication to proxy
ru: Попытка выполнить аутентификацию HTTP NTLMv%d на прокси

source: Attempting HTTP NTLMv%d authentication to server '%s'
ru: Попытка выполнить аутентификацию HTTP NTLMv%d на сервере '%s'

source: Terminating because nullppp has reached network state.
ru: Завершаем, т.к. nullppp достиг состояния сетевого подключения.

source: Invalid base32 token string
ru: Недействительная строка токена base32

source: Failed to allocate memory to decode OATH secret
ru: Не удалось выделить память для расшифровки секрета OATH

source: This version of OpenConnect was built without PSKC support
ru: Данная версия OpenConnect была собрана без поддержки PSKC

source: OK to generate INITIAL tokencode
ru: OK для создания кода токена INITIAL

source: OK to generate NEXT tokencode
ru: OK для создания кода токена NEXT

source: Server is rejecting the soft token; switching to manual entry
ru: Сервер не принимает программный токен; переключаемся на ручной ввод

source: Generating OATH TOTP token code
ru: Создаётся код токена OATH TOTP

source: Generating OATH HOTP token code
ru: Создаётся код токена OATH HOTP

source: Unexpected length %d for TLV %d/%d
ru: Непредвиденная длина %d для TLV %d/%d

source: Received MTU %d from server
ru: Получен MTU %d от сервера

source: Received DNS server %s
ru: Получен сервер DNS %s

source: Received DNS search domain %.*s
ru: Получен домен поиска DNS %.*s

source: Received internal IP address %s
ru: Получен внутренний адрес IP %s

source: Received netmask %s
ru: Получена маска сети %s

source: Received internal gateway address %s
ru: Получен внутренний адрес шлюза %s

source: Received split include route %s
ru: Получен маршрут %s включения для раздельного туннелирования

source: Received split exclude route %s
ru: Получен маршрут %s исключения для раздельного туннелирования

source: Received WINS server %s
ru: Получен сервер WINS %s

source: ESP encryption: 0x%02x (%s)
ru: Шифрование ESP: 0x%02x (%s)

source: ESP compression: %d
ru: Сжатие ESP: %d

source: ESP port: %d
ru: Порт ESP: %d

source: ESP key lifetime: %u bytes
ru: Время жизни ключа ESP: %u байт

source: ESP key lifetime: %u seconds
ru: Время жизни ключа ESP: %u сек.

source: ESP to SSL fallback: %u seconds
ru: Откат ESP на SSL: %u сек.

source: ESP replay protection: %d
ru: Защита от воспроизведения ESP: %d

source: ESP SPI (outbound): %x
ru: ESP SPI (исходящий): %x

source: %d bytes of ESP secrets
ru: %d байт секретов ESP

source: Unknown TLV group %d attr %d len %d:%s
ru: Неизвестная группа TLV %d attr %d len %d:%s

source: Failed to parse KMP header
ru: Не удалось проанализировать заголовок KMP

source: Failed to parse KMP message
ru: Не удалось проанализировать сообщение KMP

source: Got KMP message %d of size %d
ru: Получено сообщение KMP %d, размер: %d

source: Received non-ESP TLVs (group %d) in ESP negotiation KMP
ru: Получены TLV вне ESP (группа %d)при согласовании KMP ESP

source: Error creating oNCP negotiation request
ru: Ошибка создания запроса согласования oNCP

source: Short write in oNCP negotiation
ru: Недостаточно данных при согласовании oNCP

source: Read %d bytes of SSL record
ru: Прочитано %d байт записи SSL

source: Unexpected response of size %d after hostname packet
ru: Непредвиденный ответ размером %d после пакета имени хоста

source: Server response to hostname packet is error 0x%02x
ru: Ответ сервера на пакет имени хоста: ошибка 0x%02x

source: This seems to indicate that the server has disabled support for Juniper's older oNCP protocol, and only allows connections using the newer Junos Pulse protocol. This version of OpenConnect has EXPERIMENTAL support for Pulse using --prot=pulse
ru: Похоже, это указывает на то, что сервер отключил поддержку старого протокола Juniper oNCP и допускает только подключения с использованием нового протокола Junos Pulse. В данной версии OpenConnect есть ЭКСПЕРИМЕНТАЛЬНАЯ поддержка Pulse с помощью --prot=pulse

source: Read additional %d bytes of SSL record
ru: Прочитано %d дополнительных байт записи SSL

source: Invalid packet waiting for KMP 301
ru: Недействительный пакет ожидания KMP 301

source: Expected KMP message 301 from server but got %d
ru: От сервера ожидалось сообщение KMP 301, но получено %d

source: KMP message 301 from server too large (%d bytes)
ru: Слишком большой размер сообщения KMP 301 от сервера (%d байт)

source: Got KMP message 301 of length %d
ru: Получено сообщение KMP 301 длиной %d

source: Failed to read continuation record length
ru: Не удалось прочитать длину записи продолжения данных

source: Record of additional %d bytes too large; would make %d
ru: Слишком большой размер записи дополнительных %d байт; должно быть %d

source: Failed to read continuation record of length %d
ru: Не удалось прочитать запись продолжения данных длиной в %d

source: Discarding Legacy IP frame in the middle of oNCP config
ru: Кадр адреса IP старого формата в середине конфигурации oNCP не учитывается

source: Read additional %d bytes of KMP 301 message
ru: Прочитано %d дополнительных байт сообщения KMP 301

source: Error negotiating ESP keys
ru: Ошибка согласования ключей ESP

source: oNCP negotiation request outgoing:
ru: Исходящий запрос согласования oNCP:

source: new incoming
ru: новые входящие

source: new outgoing
ru: новые исходящие

source: Read only 1 byte of oNCP length field
ru: Прочитан только 1 байт поля длины oNCP

source: Server terminated connection (session expired)
ru: Сервер прервал подключение (время сеанса закончилось)

source: Server terminated connection (idle timeout)
ru: Сервер прервал подключение (истечение времени ожидания при бездействии)

source: Server terminated connection (reason: %d)
ru: Сервер прервал подключение (причина: %d)

source: Server sent zero-length oNCP record
ru: Сервер послал запись oNCP нулевой длины

source: Incoming KMP message %d of size %d (got %d)
ru: Входящее сообщение KMP %d размером %d (получено %d)

source: Continuing to process KMP message %d now size %d (got %d)
ru: Продолжаем обработку сообщения KMP %d, размер сейчас: %d (получено %d)

source: Unrecognised data packet
ru: Нераспознанный пакет данных

source: Failed to set up ESP: %s
ru: Не удалось настроить ESP: %s

source: Unknown KMP message %d of size %d:
ru: Неизвестное сообщение KMP %d размером %d:

source: .... + %d more bytes unreceived
ru: .... + %d байт ещё не получено

source: Packet outgoing:
ru: Исходящий пакет:

source: Sent ESP enable control packet
ru: Отправлен пакет включения управления ESP

source: ERROR: %s() called with invalid UTF-8 for '%s' argument
ru: ОШИБКА: %s() был вызван с недействительным UTF-8 для аргумента '%s'

source: Unable to calculate DTLS overhead for %s
ru: Невозможно рассчитать временные затраты DTLS для %s

source: Failed to generate random key
ru: Не удалось создать случайный ключ

source: Failed to create SSL_SESSION ASN.1 for OpenSSL: %s
ru: Не удалось создать SSL_SESSION ASN.1 для OpenSSL: %s

source: OpenSSL failed to parse SSL_SESSION ASN.1
ru: OpenSSL не смог проанализировать SSL_SESSION ASN.1

source: Initialise DTLSv1 session failed
ru: Сбой инициализации сеанса DTLSv1

source: Too large application ID size
ru: Слишком большой размер ID приложения

source: PSK callback
ru: Обратный вызов PSK

source: Initialise DTLSv1 CTX failed
ru: Не удалось инициализировать DTLSv1 CTX

source: Set DTLS CTX version failed
ru: Не удалось настроить версию DTLS CTX

source: Failed to generate DTLS key
ru: Не удалось создать ключ DTLS

source: Set DTLS cipher list failed
ru: Не удалось настроить список шифров DTLS

source: DTLS cipher '%s' not found
ru: Не удалось найти шифр DTLS «%s»

source: SSL_set_session() failed with DTLS protocol version 0x%x Are you using a version of OpenSSL older than 0.9.8m? See %s Use the --no-dtls command line option to avoid this message
ru: Сеанс SSL_set_session() потерпел сбой с версией протокола DTLS 0x%x Используемая версия OpenSSL старше 0.9.8m? См. %s Чтобы это сообщение не показывалось, используйте команду --no-dtls

source: SSL_set_session() failed
ru: Сбой SSL_set_session()

source: Create DTLS dgram BIO failed
ru: Не удалось создать BIO для датаграммы DTLS

source: Established DTLS connection (using OpenSSL). Ciphersuite %s-%s.
ru: Подключение DTLS создано (с помощью OpenSSL). Набор шифров %s-%s.

source: Your OpenSSL is older than the one you built against, so DTLS may fail!
ru: Используемая версия OpenSSL старше той, для которой была создана сборка, поэтому может случить сбой DTLS

source: This is probably because your OpenSSL is broken See http://rt.openssl.org/Ticket/Display.html?id=2984
ru: Скорее всего это происходит из-за ошибок в OpenSSL См. http://rt.openssl.org/Ticket/Display.html?id=2984

source: DTLS handshake failed: %d
ru: Сбой приветствия DTLS: %d

source: Failed to initialise ESP cipher:
ru: Не удалось инициализировать шифр ESP:

source: Failed to initialize ESP HMAC
ru: Не удалось инициализировать ESP HMAC

source: Failed to set up decryption context for ESP packet:
ru: Не удалось настроить контекст расшифровки для пакета ESP:

source: Failed to decrypt ESP packet:
ru: Не удалось расшифровать пакет ESP:

source: Failed to encrypt ESP packet:
ru: Не удалось зашифровать пакет ESP:

source: Failed to establish libp11 PKCS#11 context:
ru: Не удалось создать контекст libp11 PKCS#11:

source: Failed to load PKCS#11 provider module (%s):
ru: Не удалось загрузить модуль поставщика PKCS#11 (%s):

source: PIN locked
ru: PIN заблокирован

source: PIN expired
ru: Срок действия PIN истёк

source: Another user already logged in
ru: Другой пользователь уже выполнил вход

source: Unknown error logging in to PKCS#11 token
ru: Неизвестная ошибка при входе в токен PKCS#11

source: Logged in to PKCS#11 slot '%s'
ru: Выполнен вход в слот PKCS#11 '%s'

source: Failed to enumerate certs in PKCS#11 slot '%s'
ru: Не удалось перечислить сертификаты в слоте PKCS#11 '%s'

source: Found %d certs in slot '%s'
ru: Найдено сертификатов: %d в слоте '%s'

source: Failed to parse PKCS#11 URI '%s'
ru: Не удалось проанализировать PKCS#11 URI '%s'

source: Failed to enumerate PKCS#11 slots
ru: Не удалось перечислить слоты PKCS#11

source: Logging in to PKCS#11 slot '%s'
ru: Выполняется вход в слот PKCS#11 '%s'

source: Failed to find PKCS#11 cert '%s'
ru: Не удалось найти сертификат PKCS#11 '%s'

source: Certificate X.509 content not fetched by libp11
ru: libp11 не получила содержимое сертификата X.509

source: Using secondary PKCS#11 certificate %s
ru: Используется вторичный сертификат PKCS#11 %s

source: Failed to enumerate keys in PKCS#11 slot '%s'
ru: Не удалось перечислить ключи в слоте PKCS#11 '%s'

source: Found %d keys in slot '%s'
ru: Найдено ключей: %d в слоте '%s'

source: Certificate has no public key
ru: У сертификата нет открытых ключей

source: Secondary certificate has no public key
ru: У вторичного сертификата нет открытых ключей

source: Certificate does not match private key
ru: Сертификат не соответствует закрытому ключу

source: Secondary certificate does not match private key
ru: Вторичный сертификат не соответствует закрытому ключу

source: Checking EC key matches cert
ru: Проверка соответствия ключа EC сертификату

source: Failed to allocate signature buffer
ru: Не удалось выделить память для буфера подписи

source: Failed to sign dummy data to validate EC key
ru: Не удалось подписать фиктивные данные для проверки ключа EC

source: Failed to find PKCS#11 key '%s'
ru: Не удалось найти ключ PKCS#11 '%s'

source: Using secondary PKCS#11 key %s
ru: Используется вторичный ключ PKCS#11 %s

source: Failed to instantiate private key from PKCS#11
ru: Не удалось создать экземпляр закрытого ключа на базе PKCS#11

source: Failed to instantiate secondary private key from PKCS#11
ru: Не удалось создать экземпляр вторичного закрытого ключа на базе PKCS#11

source: This version of OpenConnect was built without PKCS#11 support
ru: Данная версия OpenConnect была собрана без поддержки PKCS#11

source: Failed to write to TLS/DTLS socket
ru: Не удалось записать в сокет TLS/DTLS

source: Failed to read from TLS/DTLS socket
ru: Не удалось прочитать сокет TLS/DTLS

source: Read error on %s session: %d
ru: Ошибка чтения в сеансе %s: %d

source: Write error on %s session: %d
ru: Ошибка записи в сеансе %s: %d

source: Unhandled SSL UI request type %d
ru: Необработанный тип запроса SSL UI %d

source: PEM password too long (%d >= %d)
ru: Слишком длинный пароль PEM (%d >= %d)

source: Client certificate or key missing
ru: Отсутствует клиентский сертификат или ключ

source: Loading private key failed
ru: Не удалось загрузить закрытый ключ

source: Failed to install certificate in OpenSSL context
ru: Не удалось установить сертификат в контекст OpenSSL

source: Extra cert from %s: '%s'
ru: Дополнительный сертификат от %s: '%s'

source: Parse PKCS#12 failed (see above errors)
ru: Сбой анализа PKCS#12 (см. ошибки выше)

source: Parse secondary PKCS#12 failed (see above errors)
ru: Сбой анализа вторичного PKCS#12 (см. ошибки выше)

source: PKCS#12 contained no certificate!
ru: PKCS#12 не содержал сертификатов

source: Secondary PKCS#12 contained no certificate!
ru: Вторичный PKCS#12 не содержал сертификатов

source: PKCS#12 contained no private key!
ru: PKCS#12 не содержал закрытых ключей

source: Secondary PKCS#12 contained no private key!
ru: Вторичный PKCS#12 не содержал закрытых ключей

source: Can't load TPM engine.
ru: Невозможно загрузить подсистему TPM.

source: Failed to init TPM engine
ru: Невозможно инициализировать подсистему TPM

source: Failed to set TPM SRK password
ru: Не удалось настроить пароль TPM SRK

source: Failed to load TPM private key
ru: Не удалось загрузить закрытый ключ TPM

source: Failed to load secondary TPM private key
ru: Не удалось загрузить вторичный закрытый ключ TPM
